[
    "```json\n{\n    \"Name\": \"Möbius Strip\",\n    \"Definition\": \"A surface with only one side and one boundary component, which can be constructed by taking a rectangular strip of paper, giving it a half-twist, and joining the ends together.\",\n    \"Formal Language\": \"Möbius Strip \\in Topological space\"\n}\n```",
    "```json\n{\n    \"Name\": \"Path\",\n    \"Definition\": \"In mathematics, particularly in graph theory and topology, a path is a sequence of edges which connect a sequence of vertices which are all distinct.\",\n    \"Formal Language\": \"Path \\in Graph Theory\"\n}\n```",
    "```json\n{\n    \"Name\": \"Orthogonal\",\n    \"Definition\": \"Two vectors are orthogonal if their dot product is zero, meaning they are at right angles to each other in a Euclidean space.\",\n    \"Formal Language\": \"Orthogonal \\iff \\vec{u} \\cdot \\vec{v} = 0\"\n}\n```",
    "```json\n{\n    \"Name\": \"Planar Space\",\n    \"Definition\": \"A two-dimensional flat surface extending infinitely in all directions, often considered in geometry and used to describe planes.\",\n    \"Formal Language\": \"Planar Space \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Disk\",\n    \"Definition\": \"In geometry, a disk is the region in a plane bounded by a circle. It includes the circle itself and all the points inside it.\",\n    \"Formal Language\": \"Disk \\subseteq \\mathbb{R}^2\"\n}",
    "```json\n{\n    \"Name\": \"Boundary\",\n    \"Definition\": \"A line or curve that defines the edge of a geometric figure or a set\",\n    \"Formal Language\": \"Boundary \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Endpoint\",\n    \"Definition\": \"An endpoint is a point at the boundary of a segment or a portion of a geometric figure. In an interval, the endpoints are the numbers that mark the extremities of the interval.\",\n    \"Formal Language\": \"Endpoint \\in \\{\\text{Point}\\}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Interior\",\n    \"Definition\": \"The interior of a subset S of a topological space consists of all points of S that are not boundary points.\",\n    \"Formal Language\": \"Interior(S) = {x ∈ S | ∃ε > 0, B(x, ε) ⊆ S}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Concave\",\n    \"Definition\": \"A function is concave if the line segment between any two points on the graph of the function lies below or on the graph. In the context of K-12, it is usually introduced in calculus to describe sections of curves.\",\n    \"Formal Language\": \"A function f(x) is concave on an interval if for any two points x1 and x2 in the interval, and 0 < t < 1, the inequality t*f(x1) + (1-t)*f(x2) <= f(t*x1 + (1-t)*x2) holds.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Net\",\n    \"Definition\": \"In geometry, a net is a two-dimensional pattern that can be folded to form a three-dimensional figure.\",\n    \"Formal Language\": \"Net \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Convex\",\n    \"Definition\": \"A set or shape is convex if, for every pair of points within the set, the line segment connecting them is also entirely within the set.\",\n    \"Formal Language\": \"Convex A \\subseteq \\mathbb{R}^n : \\forall x, y \\in A, \\forall \\lambda \\in [0,1], \\lambda x + (1- \\lambda )y \\in A\"\n}\n```",
    "{\n    \"Name\": \"Transversal Intersection\",\n    \"Definition\": \"A concept where a line, called the transversal, intersects two or more lines, typically in a geometry context. This interaction often creates angle relationships such as corresponding angles or alternate interior angles.\",\n    \"Formal Language\": \"Transversal \\cap Lines \\rightarrow Angle \\ Relationships\"\n}",
    "```json\n{\n    \"Name\": \"Coloring\",\n    \"Definition\": \"The way of assigning colors to the elements of a set, often used to solve problems related to graphs, maps, and geometric figures.\",\n    \"Formal Language\": \"Coloring: V \\to C (where V is a set of vertices and C is a set of colors)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Dimension\",\n    \"Definition\": \"The number of independent directions in a space, essentially the number of coordinates needed to specify a point in that space.\",\n    \"Formal Language\": \"Dimension \\in \\mathbb{N}^+\"\n}\n```",
    "```json\n{\n    \"Name\": \"Vertex Set\",\n    \"Definition\": \"In graph theory, the vertex set of a graph is the collection of all the vertices (or nodes) of the graph.\",\n    \"Formal Language\": \"Vertex Set \\in Graph Theory\"\n}\n```",
    "```json\n{\n    \"Name\": \"Euclid's Theorems\",\n    \"Definition\": \"A collection of results in geometry and number theory attributed to the ancient Greek mathematician Euclid, particularly those found in his work 'Elements'.\",\n    \"Formal Language\": \"Euclid's Theorems \\subseteq Geometry \\cup Number Theory\"\n}\n```",
    "```json\n{\n    \"Name\": \"Pythagorean Triangle\",\n    \"Definition\": \"A right triangle whose sides have lengths that satisfy the Pythagorean theorem, a² + b² = c², where c is the hypotenuse.\",\n    \"Formal Language\": \"Pythagorean Triangle \\in Geometry, where a² + b² = c²\"\n}\n```",
    "```json\n{\n    \"Name\": \"Pythagorean Triple\",\n    \"Definition\": \"A set of three positive integers a, b, and c that fit the formula a^2 + b^2 = c^2, where c is the hypotenuse of a right triangle and a and b are the other two sides.\",\n    \"Formal Language\": \"Pythagorean Triple \\in \\{(a, b, c) \\in \\mathbb{Z}^+ \\mid a^2 + b^2 = c^2\\}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Integer Triangle\",\n    \"Definition\": \"A triangle with all sides of integer length.\",\n    \"Formal Language\": \"Integer Triangle \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Square\",\n    \"Definition\": \"A square is a four-sided polygon known as a quadrilateral where all sides have equal length and all angles are right angles.\",\n    \"Formal Language\": \"Square \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Euler's Rule\",\n    \"Definition\": \"Euler's Rule, often referred to in the context of polyhedra, states that for any convex polyhedron, the number of vertices (V), edges (E), and faces (F) are related by the formula V - E + F = 2.\",\n    \"Formal Language\": \"V - E + F = 2 \\;\\; \\forall \\; \\text{convex polyhedra}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Grid Shading Problem\",\n    \"Definition\": \"A mathematical puzzle or problem involving coloring certain squares within a grid according to specific rules or conditions, often used to develop logical reasoning and problem-solving skills.\",\n    \"Formal Language\": \"Grid Shading Problem \\in Puzzle\"\n}\n```",
    "```json\n{\n    \"Name\": \"Ball\",\n    \"Definition\": \"An object in three-dimensional space; in mathematics, it often refers to the set of all points within a certain distance (the radius) from a fixed point (the center).\",\n    \"Formal Language\": \"Ball \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Circle-Circle Intersection\",\n    \"Definition\": \"The points at which two circles on a plane intersect each other.\",\n    \"Formal Language\": \"Intersection(Circle1, Circle2) = Points \\subseteq \\mathbb{R}^2\"\n}\n```",
    "{\n    \"Name\": \"Circular Segment\",\n    \"Definition\": \"A Circular Segment is a region of a circle which is 'cut off' from the rest of the circle by a chord.\",\n    \"Formal Language\": \"Circular Segment \\subseteq Circle\"\n}",
    "```json\n{\n    \"Name\": \"Tangent\",\n    \"Definition\": \"In trigonometry, the tangent of an angle in a right-angled triangle is the ratio of the length of the opposite side to the length of the adjacent side. In calculus, the tangent line to a curve at a given point is the straight line that just touches the curve at that point.\",\n    \"Formal Language\": \"Tangent \\in Trigonometry \\cup Calculus\"\n}\n```",
    "```json\n{\n    \"Name\": \"Cosine\",\n    \"Definition\": \"In trigonometry, cosine is the ratio of the adjacent side to the hypotenuse of a right-angled triangle.\",\n    \"Formal Language\": \"cos(θ) = adjacent/hypotenuse\"\n}\n```",
    "```json\n{\n    \"Name\": \"Golden Spiral\",\n    \"Definition\": \"A logarithmic spiral that grows outward by a factor of the golden ratio for every quarter turn it makes.\",\n    \"Formal Language\": \"Golden Spiral \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Golden Rectangle\",\n    \"Definition\": \"A rectangle whose side lengths are in the golden ratio, approximately 1.618.\",\n    \"Formal Language\": \"Golden Rectangle: If the ratio of the longer side to the shorter side is φ (phi), where φ = (1 + √5) / 2.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Golden Rhombus\",\n    \"Definition\": \"A rhombus in which the diagonals are in the golden ratio, that is, the ratio of the lengths of its diagonals is the golden ratio (approximately 1.618).\",\n    \"Formal Language\": \"Golden Rhombus \\subseteq Geometric Shapes\"\n}\n```",
    "```json\n{\n    \"Name\": \"Obtuse Triangle\",\n    \"Definition\": \"A triangle in which one of the angles is an obtuse angle, meaning it is greater than 90 degrees but less than 180 degrees.\",\n    \"Formal Language\": \"Obtuse Triangle \\subset Triangle\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polygon Circumscribing\",\n    \"Definition\": \"A polygon circumscribing a circle is a polygon where each of its sides is tangent to the circle.\",\n    \"Formal Language\": \"Polygon Circumscribing \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polygon Inscribing\",\n    \"Definition\": \"The process of drawing one polygon inside another such that all the vertices of the inscribed polygon touch the edges of the outer polygon.\",\n    \"Formal Language\": \"Polygon Inscribing \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Pi\",\n    \"Definition\": \"Pi is a mathematical constant representing the ratio of a circle's circumference to its diameter, approximately equal to 3.14159.\",\n    \"Formal Language\": \"Pi \\in \\mathbb{R}, \\text{where it is a constant often denoted as } \\pi\"\n}\n```",
    "{\n    \"Name\": \"Pi Formulas\",\n    \"Definition\": \"Equations and expressions involving the mathematical constant Pi (π), a transcendental number approximately equal to 3.14159, commonly used in geometry and trigonometry to relate the diameter and circumference of a circle and in various integral formulas.\",\n    \"Formal Language\": \"Pi \\in \\mathbb{R}\"\n}",
    "```json\n{\n    \"Name\": \"Congruence\",\n    \"Definition\": \"Congruence refers to the exact overlap in shape and size of geometric figures or, in numbers, a relation indicating equal equivalence under some modulus.\",\n    \"Formal Language\": \"Geometric: Congruence \\in Geometry; Numbers: a ≡ b (mod n) where a, b, n \\in Integers\"\n}\n```",
    "```json\n{\n    \"Name\": \"Pythagoras's Theorem\",\n    \"Definition\": \"A fundamental relation in Euclidean geometry among the three sides of a right triangle, stating that the square of the length of the hypotenuse is equal to the sum of the squares of the lengths of the other two sides.\",\n    \"Formal Language\": \"c^2 = a^2 + b^2, where c is the hypotenuse and a, b are the other sides of a right triangle.\"\n}\n```",
    "{\n    \"Name\": \"Congruent\",\n    \"Definition\": \"In geometry, congruent refers to figures or objects that are the same shape and size.\",\n    \"Formal Language\": \"Two figures A and B are congruent if there exists a rigid transformation T such that T(A) = B. Notation: A \\cong B.\"\n}",
    "```json\n{\n    \"Name\": \"Figures\",\n    \"Definition\": \"Shapes or forms, often used in geometry, including two-dimensional shapes like rectangles and circles, and three-dimensional shapes like cubes and spheres.\",\n    \"Formal Language\": \"Figures \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Trigonometry Angles\",\n    \"Definition\": \"Trigonometry is a branch of mathematics that studies relationships involving lengths and angles of triangles. Angles in trigonometry are typically measured in degrees or radians and are the foundation for defining trigonometric functions like sine, cosine, and tangent.\",\n    \"Formal Language\": \"Trigonometry Angles \\in Mathematics, Angles \\in [0^\\circ, 360^\\circ] \\cup [0, 2\\pi] \\, (\\text{in radians})\"\n}\n```",
    "```json\n{\n    \"Name\": \"Trigonometry Angles--Pi16\",\n    \"Definition\": \"Refers to angles in trigonometry that are multiples of \\(\\frac{\\pi}{16}\\), commonly used in more advanced trigonometric calculations.\",\n    \"Formal Language\": \"Trigonometry Angles--Pi16 \\in Angle \\cap \\lbrace \\theta = k \\cdot \\frac{\\pi}{16} \\mid k \\in \\mathbb{Z} \\rbrace\"\n}\n```",
    "```json\n{\n    \"Name\": \"Trigonometry Angles--Pi\",\n    \"Definition\": \"Trigonometry angles often represented in terms of Pi to simplify expressions involving angles measured in radians.\",\n    \"Formal Language\": \"Angle \\in \\mathbb{R}, commonly expressed as \\theta = n\\pi, where n \\in \\mathbb{Q}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Trigonometry Angles--Pi/2\",\n    \"Definition\": \"An angle measured in radians equal to one-half π (pi), which is equivalent to 90 degrees. It is commonly used in trigonometry to represent the angle at which the sine function reaches its maximum value of 1, while the cosine function equals 0.\",\n    \"Formal Language\": \"Trigonometry Angle \\in [0, π] \\quad \\text{where}\\ \\frac{π}{2} \\in Real\"\n}\n```",
    "```json\n{\n    \"Name\": \"Trigonometry Angles\",\n    \"Definition\": \"Angles commonly used in trigonometry, often measured in degrees or radians, and include specific angles such as 0°, 30°, 45°, 60°, 90°, or their radian equivalents like π/6, π/4, π/3.\",\n    \"Formal Language\": \"Trigonometry Angles \\in Geometry \\wedge Trigonometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Trigonometry Angles--Pi/3\",\n    \"Definition\": \"Pi/3 is an angle in radians, equivalent to 60 degrees, commonly used in trigonometry. It is often used to determine the sine, cosine, and tangent values of angles in teaching basic trigonometric functions.\",\n    \"Formal Language\": \"Trigonometry Angle \\in Radian\"\n}\n```",
    "{\n    \"Name\": \"Trigonometry Angles--Pi/4\",\n    \"Definition\": \"The angle π/4 (or 45 degrees) is a commonly used angle in trigonometry, particularly within the unit circle, where sine, cosine, and tangent functions are evaluated.\",\n    \"Formal Language\": \"Angle \\theta = \\frac{\\pi}{4} \\in \\text{Radians} \\quad \\text{or} \\quad 45^\\circ \\in \\text{Degrees}\"\n}",
    "```json\n{\n    \"Name\": \"Trigonometry Angles--Pi/5\",\n    \"Definition\": \"An angle that measures π/5 radians, which is equivalent to 36 degrees. It's used in trigonometry to calculate the sine, cosine, and other trigonometric functions.\",\n    \"Formal Language\": \"Trigonometry Angles \\in Angle \\land \\text{Measurement in Radians} \\land \\pi/5 = 36^\\circ\"\n}\n```",
    "```json\n{\n    \"Name\": \"Trigonometry Angles - Pi/6\",\n    \"Definition\": \"Pi/6 is an angle measure in radians equivalent to 30 degrees, commonly used in trigonometry to evaluate sine, cosine, and tangent functions.\",\n    \"Formal Language\": \"Pi/6 \\in \\mathbb{R} \\text{ (Angle in radians)}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Trigonometry Angles--Pi/8\",\n    \"Definition\": \"Angles used in trigonometry often dealing with radians, where Pi/8 is a specific measure representing 22.5 degrees.\",\n    \"Formal Language\": \"Angle \\in \\left\\{ \\frac{\\pi}{8}, \\text{Trigonometric Function Evaluations} \\right\\}\"\n}\n```",
    "{\n    \"Name\": \"Trigonometry Angles--Pi/9\",\n    \"Definition\": \"An angle measurement used in trigonometry, where Pi/9 radians is equivalent to 20 degrees.\",\n    \"Formal Language\": \"Trigonometry \\in Mathematics\"\n}",
    "```json\n{\n    \"Name\": \"Trigonometry Angles--Pi/10\",\n    \"Definition\": \"This refers to angles used in trigonometry, with Pi/10 representing an angle of 18 degrees. Such angles are often studied in higher mathematics but can be introduced in the context of understanding radians in the high school curriculum.\",\n    \"Formal Language\": \"Trigonometry Angles--Pi/n \\in Angle \\in Radians\"\n}\n```",
    "```json\n{\n    \"Name\": \"Trigonometry Angles\",\n    \"Definition\": \"Angles measured in degrees or radians that are used in trigonometry to define the ratios of the sides of a right triangle relative to one of its acute angles.\",\n    \"Formal Language\": \"Trigonometry Angles \\in Measurement\"\n}\n```",
    "```json\n{\n    \"Name\": \"Trigonometry Angles--Pi15\",\n    \"Definition\": \"This refers to angles measured in degrees and often expressed as fractions of π, specifically in common trigonometric angles. Examples include angles like 30°, 45°, and 60°, which are π/6, π/4, and π/3 radians, respectively. The term 'Pi15' might refer to a specific angle, but this is unconventional terminology. It could be interpreted as π radians divided by 15.\",\n    \"Formal Language\": \"Trigonometry Angles--Pi15 \\in [0, 2π], Angle \\in \\Radian\"\n}\n```",
    "```json\n{\n    \"Name\": \"Law of Cosines\",\n    \"Definition\": \"A formula relating the lengths of the sides of a triangle to the cosine of one of its angles.\",\n    \"Formal Language\": \"For triangles: c^2 = a^2 + b^2 - 2ab*cos(C), with sides a, b, c opposite to angles A, B, C respectively.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Law of Sines\",\n    \"Definition\": \"The Law of Sines is a formula which helps to find unknown angles and sides of a triangle. It states that the ratio of the length of a side of a triangle to the sine of its opposite angle is the same for all three sides of the triangle.\",\n    \"Formal Language\": \"For a triangle ABC, \\\\( \\\\frac{a}{\\\\sin(A)} = \\\\frac{b}{\\\\sin(B)} = \\\\frac{c}{\\\\sin(C)} \\\\)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Secant\",\n    \"Definition\": \"In trigonometry, the secant of an angle in a right triangle is the ratio of the hypotenuse to the adjacent side. In calculus, a secant line is a line that intersects a curve at two or more points.\",\n    \"Formal Language\": \"Secant \\in Trigonometric Functions \\cup Calculus Concepts\"\n}\n```",
    "```json\n{\n    \"Name\": \"Sine\",\n    \"Definition\": \"A trigonometric function of an angle, defined as the ratio of the length of the side of the opposite angle to the hypotenuse in a right-angled triangle.\",\n    \"Formal Language\": \"Sine: \\\\sin(\\\\theta) = \\\\frac{\\\\text{Opposite Side}}{\\\\text{Hypotenuse}}, \\\\theta \\\\in [0, 2\\\\pi]\"\n}\n```",
    "```json\n{\n    \"Name\": \"Sinusoid\",\n    \"Definition\": \"A sinusoid is a mathematical curve that describes a smooth periodic oscillation. It is the graph of the sine function in trigonometry.\",\n    \"Formal Language\": \"Sinusoid \\in Function\"\n}\n```",
    "```json\n{\n    \"Name\": \"Cosecant\",\n    \"Definition\": \"The cosecant of an angle in a right triangle is the reciprocal of the sine. It is defined as the ratio of the length of the hypotenuse to the length of the opposite side.\",\n    \"Formal Language\": \"csc(θ) = 1/sin(θ)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Inverse Cosine\",\n    \"Definition\": \"The inverse function of the cosine function, often written as cos⁻¹(x) or arccos(x), which yields the angle whose cosine is x.\",\n    \"Formal Language\": \"arccos : [-1, 1] \\to [0, \\pi]\"\n}\n```",
    "```json\n{\n    \"Name\": \"Solid Angle\",\n    \"Definition\": \"A measure of the amount of the field of view from some particular point that a given object covers. It is the two-dimensional angle in three-dimensional space that an object subtends at a point.\",\n    \"Formal Language\": \"Solid Angle \\in \\mathbb{R} \\, \\text{sr}, \\, \\text{where} \\, \\text{sr} \\, \\text{is steradians, the unit of solid angle.}\"\n}\n```",
    "```json\n{\n    \"Name\": \"SOHCAHTOA\",\n    \"Definition\": \"A mnemonic device used to remember the definitions of the trigonometric functions sine, cosine, and tangent, relating to the angles and sides of a right triangle.\",\n    \"Formal Language\": \"For right triangle functions: Sine = Opposite/Hypotenuse, Cosine = Adjacent/Hypotenuse, Tangent = Opposite/Adjacent\"\n}\n```",
    "```json\n{\n    \"Name\": \"Trigonometry\",\n    \"Definition\": \"A branch of mathematics that deals with the relationships between the sides and angles of triangles, particularly right triangles.\",\n    \"Formal Language\": \"Trigonometry \\subset Mathematics\"\n}\n```",
    "```json\n{\n    \"Name\": \"Line-Line Angle\",\n    \"Definition\": \"The angle formed between two intersecting lines, calculated by measuring the smallest angle between the two lines.\",\n    \"Formal Language\": \"Line-Line Angle \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Acute Angle\",\n    \"Definition\": \"An angle that measures greater than 0 degrees and less than 90 degrees.\",\n    \"Formal Language\": \"Acute Angle \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Degree\",\n    \"Definition\": \"A unit of measurement for angles, with one degree equal to 1/360 of a full rotation.\",\n    \"Formal Language\": \"Degree \\in Measurement \\of Angle\"\n}\n```",
    "```json\n{\n    \"Name\": \"Radian\",\n    \"Definition\": \"A unit of measurement for angles where one radian is the angle created by taking the radius of a circle and wrapping it along the circle's edge.\",\n    \"Formal Language\": \"Radian \\in \\Theta \\ (\\text{Angle measures in radians})\"\n}\n```",
    "```json\n{\n    \"Name\": \"Angle\",\n    \"Definition\": \"An angle is formed by two rays with the same endpoint, and it measures the rotation needed to superimpose one of the rays onto the other.\",\n    \"Formal Language\": \"Angle \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Reflex Angle\",\n    \"Definition\": \"An angle that is greater than 180 degrees and less than 360 degrees.\",\n    \"Formal Language\": \"Reflex Angle \\in (180^\\circ, 360^\\circ)\"\n}",
    "```json\n{\n    \"Name\": \"Angle Bisector\",\n    \"Definition\": \"A line or ray that divides an angle into two congruent angles.\",\n    \"Formal Language\": \"Angle Bisector \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Exterior Angle\",\n    \"Definition\": \"An exterior angle is the angle formed between any side of a polygon and an adjacent side extended outward.\",\n    \"Formal Language\": \"Exterior Angle \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Angle Bisector Theorem\",\n    \"Definition\": \"A theorem that states that an angle bisector of a triangle divides the opposite side into two segments that are proportional to the other two sides of the triangle.\",\n    \"Formal Language\": \"If a line AD bisects angle BAC in triangle ABC, then BD/DC = AB/AC\"\n}\n```",
    "```json\n{\n    \"Name\": \"Exterior Angle Bisector\",\n    \"Definition\": \"An exterior angle bisector of a triangle is a line or ray that divides an exterior angle into two equal parts.\",\n    \"Formal Language\": \"If \\(\\angle ABC\\) is an exterior angle of triangle \\(\\triangle DEF\\), then the exterior angle bisector is a line or ray that divides \\(\\angle ABC\\) into two angles of equal measure.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Right Angle\",\n    \"Definition\": \"An angle that measures exactly 90 degrees.\",\n    \"Formal Language\": \"Right Angle = 90°\"\n}\n```",
    "```json\n{\n    \"Name\": \"Exterior Angle Theorem\",\n    \"Definition\": \"A theorem in geometry that states that the measure of an exterior angle of a triangle is equal to the sum of the measures of the two nonadjacent interior angles.\",\n    \"Formal Language\": \"ExteriorAngle \\in Geometry.Triangle, ∀ ΔABC, ∠ACD = ∠CAB + ∠CBA\"\n}\n```",
    "```json\n{\n    \"Name\": \"Angle of Incidence\",\n    \"Definition\": \"The angle that an incoming line or ray makes with a perpendicular to the surface at the point of incidence.\",\n    \"Formal Language\": \"Angle of Incidence \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Straight Angle\",\n    \"Definition\": \"An angle that measures exactly 180 degrees\",\n    \"Formal Language\": \"Straight Angle = 180°\"\n}\n```",
    "```json\n{\n    \"Name\": \"Angle Standard Position\",\n    \"Definition\": \"An angle is in standard position if its vertex is at the origin of the coordinate system and one ray is on the positive x-axis.\",\n    \"Formal Language\": \"An angle \\theta in standard position has its initial side along the positive x-axis and its vertex at the origin in the Cartesian plane.\"\n}\n```",
    "{\n    \"Name\": \"Full Angle\",\n    \"Definition\": \"A full angle is an angle that measures exactly 360 degrees, representing a complete rotation around a point.\",\n    \"Formal Language\": \"Full Angle = 360^\\circ\"\n}",
    "```json\n{\n    \"Name\": \"Subtend\",\n    \"Definition\": \"To be opposite to and delimit an angle or side, often used in geometry to describe the relationship between a side of a polygon or a chord and its corresponding angle or arc.\",\n    \"Formal Language\": \"Subtend \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Angle Trisection\",\n    \"Definition\": \"The problem of dividing an angle into three equal parts using only a compass and straightedge, which was proven impossible for arbitrary angles.\",\n    \"Formal Language\": \"AngleTrisection \\nexists Solvable \\forall \\theta\"\n}\n```",
    "```json\n{\n    \"Name\": \"Gradian\",\n    \"Definition\": \"A unit of angular measurement where the right angle is divided into 100 grads.\",\n    \"Formal Language\": \"Gradian \\in Unit\"\n}\n```",
    "{\n    \"Name\": \"Supplementary Angles\",\n    \"Definition\": \"Two angles that add up to 180 degrees.\",\n    \"Formal Language\": \"If \\alpha and \\beta are angles, \\alpha + \\beta = 180^\\circ implies they are supplementary.\"\n}",
    "```json\n{\n    \"Name\": \"Initial Side\",\n    \"Definition\": \"In the context of angles, the initial side is the position of the ray before rotation begins around the vertex.\",\n    \"Formal Language\": \"Initial Side \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Apex\",\n    \"Definition\": \"Generally refers to the highest point or the top of something, often used in geometry to describe the vertex opposite the base of a figure such as a pyramid or cone.\",\n    \"Formal Language\": \"Apex \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Inscribed Angle\",\n    \"Definition\": \"An angle formed by two chords in a circle which have a common endpoint. This point is on the circle, and thus, the angle is inscribed in the circle.\",\n    \"Formal Language\": \"InscribedAngle \\subseteq CircleGeometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Terminal Side\",\n    \"Definition\": \"In an angle in standard position, the terminal side is the ray where the angle ends after rotation around the vertex from the initial side.\",\n    \"Formal Language\": \"Terminal Side \\in Angle \\, Theory\"\n}\n```",
    "```json\n{\n    \"Name\": \"Arc Minute\",\n    \"Definition\": \"An arc minute is a unit of angular measurement equal to 1/60th of one degree.\",\n    \"Formal Language\": \"Arc Minute \\in Angular Measurement\"\n}\n```",
    "```json\n{\n    \"Name\": \"Interior Angle\",\n    \"Definition\": \"An interior angle is the angle formed between two sides of a polygon that is inside the polygon. In the context of a simple polygon, it refers to angles inside the polygon that are less than 180 degrees.\",\n    \"Formal Language\": \"InteriorAngle \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Thales' Theorem\",\n    \"Definition\": \"Thales' Theorem states that if A, B, and C are points on a circle where line AC is a diameter of the circle, then the angle ∠ABC is a right angle.\",\n    \"Formal Language\": \"If A, B, C \\in Circle \\land AC \\text{ is a diameter} \\Rightarrow \\angle ABC = 90^\\circ\"\n}\n```",
    "```json\n{\n    \"Name\": \"Arc Second\",\n    \"Definition\": \"An angular measurement unit used in geometry, astronomy, and other sciences, equal to 1/3600 of a degree.\",\n    \"Formal Language\": \"Arc Second \\in \\{angle \\mid 1/3600 \\times degree\\}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Triangle Postulate\",\n    \"Definition\": \"The Triangle Postulate states that the sum of the measures of the interior angles of a triangle is always 180 degrees.\",\n    \"Formal Language\": \"∑(angle A, angle B, angle C) = 180° for triangle ABC\"\n}\n```",
    "```json\n{\n    \"Name\": \"Central Angle\",\n    \"Definition\": \"An angle whose vertex is at the center of a circle and whose sides intersect the circle at two points.\",\n    \"Formal Language\": \"Central Angle \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Oblique Angle\",\n    \"Definition\": \"An angle that is not a right angle; it can be either acute or obtuse.\",\n    \"Formal Language\": \"0° < Oblique Angle < 90° or 90° < Oblique Angle < 180°\"\n}\n```",
    "```json\n{\n    \"Name\": \"Obtuse Angle\",\n    \"Definition\": \"An angle that measures more than 90 degrees but less than 180 degrees.\",\n    \"Formal Language\": \"Obtuse Angle \\in Angle | 90^\\circ < \\text{angle} < 180^\\circ\"\n}\n```",
    "```json\n{\n    \"Name\": \"Complementary Angles\",\n    \"Definition\": \"Two angles whose measures add up to 90 degrees.\",\n    \"Formal Language\": \"Complementary\\_Angles(A, B) \\iff (A + B = 90^\\circ)\"\n}\n```",
    "{\n    \"Name\": \"Vertex Angle\",\n    \"Definition\": \"The angle formed by two legs of an isosceles triangle that are equal in length; alternatively, the angle formed where two lines intersect at a vertex in a polygon or polyhedron.\",\n    \"Formal Language\": \"Vertex Angle \\in Geometry\"\n}",
    "```json\n{\n    \"Name\": \"Vertical Angles\",\n    \"Definition\": \"Vertical angles are the angles opposite each other when two lines intersect.\",\n    \"Formal Language\": \"Vertical Angles \\in Angle Pair Relationship\"\n}\n```",
    "```json\n{\n    \"Name\": \"Coterminal Angle\",\n    \"Definition\": \"Coterminal angles are angles in standard position that share the same terminal side. They differ by an integer multiple of 360° or 2π radians.\",\n    \"Formal Language\": \"CoterminalAngle(θ) = {θ + 360°k | k ∈ ℤ} or {θ + 2πk | k ∈ ℤ}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polar Angle\",\n    \"Definition\": \"The angle measured from the positive x-axis to a point in a polar coordinate system.\",\n    \"Formal Language\": \"PolarAngle \\in [0, 2\\pi) \\text{ or } [0, 360^\\circ)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Unit Circle\",\n    \"Definition\": \"A circle with a radius of one, centered at the origin of the coordinate plane, often used in trigonometry.\",\n    \"Formal Language\": \"Unit Circle \\subseteq \\mathbb{R}^2\"\n}\n```",
    "```json\n{\n    \"Name\": \"Non-Euclidean Geometry\",\n    \"Definition\": \"A type of geometry that modifies Euclid's parallel postulate, allowing for different properties of space, such as hyperbolic and elliptical geometry.\",\n    \"Formal Language\": \"Non-Euclidean Geometry \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Rectangle Tiling\",\n    \"Definition\": \"Rectangle tiling involves covering a rectangular area completely without any gaps or overlaps using smaller tiles of specified shapes, usually rectangular as well.\",\n    \"Formal Language\": \"Rectangle Tiling \\in Geometric Concepts\"\n}\n```",
    "```json\n{\n    \"Name\": \"Circle Division by Chords\",\n    \"Definition\": \"The problem of dividing a circle into regions using chords, often involving determining the maximum number of regions from n chords.\",\n    \"Formal Language\": \"Circle Division \\in Geometry, Chords \\in Line Segments\"\n}\n```",
    "```json\n{\n    \"Name\": \"Circle Division by Lines\",\n    \"Definition\": \"The number of regions created when straight lines intersect a circle. It involves geometry and combinatorics to determine how many regions are formed by a given number of lines.\",\n    \"Formal Language\": \"Circle \\cup Lines \\to Regions\"\n}\n```",
    "```json\n{\n    \"Name\": \"Square Division by Lines\",\n    \"Definition\": \"A concept where a square is divided into smaller sections using straight lines, used to explore geometric properties and relationships.\",\n    \"Formal Language\": \"Square \\dividedby Lines \\subseteq Geometric Exploration\"\n}\n```",
    "```json\n{\n    \"Name\": \"Cylinder Cutting\",\n    \"Definition\": \"A geometric concept involving the intersection of a plane with a cylinder, resulting in shapes such as ellipses or circles.\",\n    \"Formal Language\": \"Cylinder Cutting \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Plane Division by Lines\",\n    \"Definition\": \"The concept of dividing a plane into several regions by using straight lines. Each line potentially divides the plane into additional regions.\",\n    \"Formal Language\": \"Plane \\div Lines \\rightarrow Regions\"\n}\n```",
    "```json\n{\n    \"Name\": \"Rigid Motion\",\n    \"Definition\": \"A transformation of the plane or space that preserves distance and angle measures, resulting in an unchanged shape and size of a geometric figure.\",\n    \"Formal Language\": \"RigidMotion : \\mathbb{R}^n \\rightarrow \\mathbb{R}^n \\; | \\; \\forall x, y \\in \\mathbb{R}^n, \\; d(f(x), f(y)) = d(x, y)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Translate\",\n    \"Definition\": \"To move every point of a shape or function the same distance in a given direction.\",\n    \"Formal Language\": \"Translation \\in Transformations\"\n}\n```",
    "```json\n{\n    \"Name\": \"Translation\",\n    \"Definition\": \"Translation is a geometric transformation that moves every point of a shape or object a constant distance in a specified direction.\",\n    \"Formal Language\": \"Translation \\in Transformation\"\n}\n```",
    "```json\n{\n    \"Name\": \"Half-Turn\",\n    \"Definition\": \"A rotation of 180 degrees around a point, resulting in an object facing the opposite direction.\",\n    \"Formal Language\": \"Half-Turn \\in Transformation\"\n}\n```",
    "```json\n{\n    \"Name\": \"Rotation\",\n    \"Definition\": \"A transformation in which a figure is turned around a fixed point, called the center of rotation, through a specified angle and direction.\",\n    \"Formal Language\": \"Rotation \\in Transformation\"\n}\n```",
    "{\n    \"Name\": \"Rotation Formula\",\n    \"Definition\": \"A mathematical rule used to rotate points in the coordinate plane around the origin by a specific angle, often multiples of 90 degrees.\",\n    \"Formal Language\": \"Rotation \\in Transformations, (x', y') = (x*cos(θ) - y*sin(θ), x*sin(θ) + y*cos(θ))\"\n}",
    "```json\n{\n    \"Name\": \"Rotation Matrix\",\n    \"Definition\": \"A matrix used to perform a rotation in a Euclidean space, typically in two or three dimensions, according to a specific angle.\",\n    \"Formal Language\": \"RotationMatrix \\in Matrix, \\exists \\theta : R(θ)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Mirror Plane\",\n    \"Definition\": \"A plane across which a shape or object is reflected in order to produce a mirror image.\",\n    \"Formal Language\": \"Mirror Plane \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Reflection\",\n    \"Definition\": \"A transformation creating a mirror image of a shape or object over a line or plane.\",\n    \"Formal Language\": \"Reflection: \\mathbb{R}^n \\rightarrow \\mathbb{R}^n, f(x) = -x \\\\text{ or } f(x)=2a-x, \\\\text{ where 'a' is the line of reflection}\"\n}",
    "```json\n{\n    \"Name\": \"Reflection Property\",\n    \"Definition\": \"The property that states that a reflection of a figure over a specific line results in a mirror image, where each point of the image is equidistant from the line of reflection as its corresponding point in the original figure.\",\n    \"Formal Language\": \"Reflection \\in Transformation \\text{ such that } p' = 2l - p \\text{ if } l \\text{ is the line of reflection and } p \\text{ is a point on the original figure}.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Mirror Image\",\n    \"Definition\": \"A transformation creating a symmetric copy of a shape where each point is at an equal distance from a central line, in the opposite direction.\",\n    \"Formal Language\": \"Mirror Image \\in Transformation\"\n}\n```",
    "```json\n{\n    \"Name\": \"Spherical Mirror\",\n    \"Definition\": \"A mirror with a consistent curve that is part of the surface of a sphere, with two types: concave (curves inward) and convex (curves outward).\",\n    \"Formal Language\": \"Spherical Mirror \\in Geometric Optics\"\n}\n```",
    "```json\n{\n    \"Name\": \"Shear\",\n    \"Definition\": \"A transformation that slants the shape of an object along one axis. In the context of linear algebra and geometry, it's a mapping that displaces each point in a fixed direction, dependent on its position.\",\n    \"Formal Language\": \"Shear \\in Transformation\"\n}\n```",
    "```json\n{\n    \"Name\": \"Similarity Transformation\",\n    \"Definition\": \"A similarity transformation is a composition of basic rigid motions (rotation, translation, reflection) followed by a dilation. It is used to demonstrate that figures are similar, having the same shape but not necessarily the same size.\",\n    \"Formal Language\": \"Similarity Transformation: f(x) = D \\circ (R \\circ T \\circ S)(x)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Isometry\",\n    \"Definition\": \"A transformation in geometry that preserves distances between points, meaning the pre-image and image are congruent.\",\n    \"Formal Language\": \"Isometry \\in {Translation, Rotation, Reflection, Glide Reflection}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Symmetric Points\",\n    \"Definition\": \"Two points are called symmetric with respect to a point if that point is the midpoint of the segment joining them. They are symmetric with respect to a line if the line is the perpendicular bisector of the segment joining them.\",\n    \"Formal Language\": \"SymmetricPoints \\subseteq Geometry \\text{, where symmetry is defined with respect to a midpoint or a line bisector}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Congruence Transformation\",\n    \"Definition\": \"A transformation that changes the position of a figure without altering its shape or size, such as rotations, reflections, or translations.\",\n    \"Formal Language\": \"Congruence Transformation \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Symmetry Principle\",\n    \"Definition\": \"A principle stating that if a system is unchanged under some transformation, then its properties should also remain unchanged.\",\n    \"Formal Language\": \"Symmetry Principle \\in Physics\"\n}\n```",
    "```json\n{\n    \"Name\": \"Transformation\",\n    \"Definition\": \"A change in the position, size, or shape of a figure or graph\",\n    \"Formal Language\": \"Transformation: f(x) -> f'(x) or T: R^n -> R^n (where T is a transformation function)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Enlargement\",\n    \"Definition\": \"A transformation that changes the size of an object without altering its shape. In mathematical terms, this can be referred to in geometry as a dilation.\",\n    \"Formal Language\": \"Enlargement \\in Transformation\"\n}\n```",
    "```json\n{\n    \"Name\": \"Euclidean Motion\",\n    \"Definition\": \"A Euclidean motion is a transformation of the Euclidean plane or space that preserves distances and angles, such as translations, rotations, and reflections.\",\n    \"Formal Language\": \"Euclidean Motion \\in Geometry, \\text{preserving properties} = \\text{distance, angle}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Central Dilation\",\n    \"Definition\": \"A transformation that enlarges or reduces a figure by a scale factor relative to a fixed point called the center of dilation.\",\n    \"Formal Language\": \"Dilation_{k,C}(P) \\in Geometry, \\\\text{ where } P \\\\text{ is a point and } C \\\\text{ is the center, scale factor } k\"\n}\n```",
    "```json\n{\n    \"Name\": \"Dilation\",\n    \"Definition\": \"A transformation that produces an image that is the same shape as the original, but is a different size. A dilation enlarges or reduces the size of a geometric figure.\",\n    \"Formal Language\": \"Dilation: (x, y) -> (kx, ky)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Stretch\",\n    \"Definition\": \"A transformation that alters the size of a geometric figure by scaling either horizontally, vertically, or in both directions.\",\n    \"Formal Language\": \"Stretch \\in Transformation\"\n}\n```",
    "```json\n{\n    \"Name\": \"Locus\",\n    \"Definition\": \"A set of points that satisfy a certain condition or are determined by a specific rule.\",\n    \"Formal Language\": \"Locus = \\\\{ P \\ | \\text{Condition}(P) \\\\}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Point-Point Distance--3-Dimensional\",\n    \"Definition\": \"The distance between two points in three-dimensional space, calculated using the distance formula.\",\n    \"Formal Language\": \"Distance_{3D} = \\\\sqrt{(x_2 - x_1)^2 + (y_2 - y_1)^2 + (z_2 - z_1)^2}\"\n}\n```",
    "{\n    \"Name\": \"Distance\",\n    \"Definition\": \"The amount of space between two points, typically measured along the shortest path connecting them in a straight line.\",\n    \"Formal Language\": \"Distance \\in Measurement\"\n}",
    "```json\n{\n    \"Name\": \"Mean Line Segment Length\",\n    \"Definition\": \"The average length of a set of line segments, calculated by finding the sum of the lengths of the segments and then dividing by the number of segments.\",\n    \"Formal Language\": \"Mean \\in \\dfrac{\\Sigma \\text{Line Segment Lengths}}{\\text{Number of Segments}}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Point-Line Distance--2-Dimensional\",\n    \"Definition\": \"The shortest distance from a point to a line in a 2-dimensional plane.\",\n    \"Formal Language\": \"Distance = |Ax1 + By1 + C| / sqrt(A^2 + B^2), where the line is Ax + By + C = 0 and the point is (x1, y1)\"\n}\n```",
    "{\n    \"Name\": \"Line-Line Distance\",\n    \"Definition\": \"The perpendicular distance between two parallel lines in a plane.\",\n    \"Formal Language\": \"Distance_{line-line} = \\\\frac{|C_2 - C_1|}{\\\\sqrt{A^2 + B^2}}, \\\\text{ where the lines are of the form } Ax + By + C_1 = 0 \\\\text{ and } Ax + By + C_2 = 0\"\n}",
    "```json\n{\n    \"Name\": \"Point-Plane Distance\",\n    \"Definition\": \"The shortest distance between a given point and a plane in three-dimensional space, often found using perpendicular projections.\",\n    \"Formal Language\": \"d = |ax_1 + by_1 + cz_1 + d| / sqrt(a^2 + b^2 + c^2), \\nwhere ax + by + cz + d = 0 is the plane equation, and (x1, y1, z1) is the point coordinates.\"\n}\n```",
    "{\n    \"Name\": \"Point-Point Distance--2-Dimensional\",\n    \"Definition\": \"The distance between two points in a 2-dimensional space using the Pythagorean theorem, calculated as the square root of the sum of the squared differences in the x-coordinates and y-coordinates.\",\n    \"Formal Language\": \"d(A, B) = \\\\sqrt{(x_2 - x_1)^2 + (y_2 - y_1)^2} \\\\text{, where } A(x_1, y_1), B(x_2, y_2) \\\\in \\\\mathbb{R}^2\"\n}",
    "```json\n{\n    \"Name\": \"Rotational Symmetry\",\n    \"Definition\": \"Rotational symmetry is when an object can be rotated around a center point and still look the same at specific angles.\",\n    \"Formal Language\": \"Rotational Symmetry \\in Symmetry \\land \\exists \\theta \\in [0, 360^\\circ) \\mid \\text{The object is unchanged under rotation by }\\theta\"\n}\n```",
    "```json\n{\n    \"Name\": \"Symmetry\",\n    \"Definition\": \"A property where an object is invariant or unchanged under certain transformations, such as reflection or rotation.\",\n    \"Formal Language\": \"Symmetry \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Symmetry Operation\",\n    \"Definition\": \"A symmetry operation is an action that leaves an object looking the same after it has been carried out. Symmetry operations can include rotations, reflections, and translations.\",\n    \"Formal Language\": \"Symmetry Operation \\in Transformations\"\n}\n```",
    "```json\n{\n    \"Name\": \"Orthotope\",\n    \"Definition\": \"An orthotope is a generalization of a rectangle to higher dimensions, also known as a hyperrectangle. In two dimensions, it is a rectangle; in three dimensions, it is a rectangular prism (also known as a cuboid).\",\n    \"Formal Language\": \"Orthotope \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Pythagorean Square Puzzle\",\n    \"Definition\": \"A mathematical activity or puzzle involving squares constructed on the sides of a right-angled triangle, illustrating the Pythagorean Theorem.\",\n    \"Formal Language\": \"Pythagorean Square Puzzle ∈ Educational Activity\"\n}\n```",
    "```json\n{\n    \"Name\": \"Soma Cube\",\n    \"Definition\": \"A Soma Cube is a 3D puzzle made up of seven different pieces formed by unit cubes, which can be assembled into a cube in multiple ways.\",\n    \"Formal Language\": \"Soma Cube \\in Recreational Mathematics\"\n}\n```",
    "```json\n{\n    \"Name\": \"Square Dissection\",\n    \"Definition\": \"The process of dividing a square into a finite number of smaller squares, typically of different sizes.\",\n    \"Formal Language\": \"Square Dissection \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Stomachion\",\n    \"Definition\": \"An ancient mathematical puzzle attributed to Archimedes, consisting of a square divided into 14 pieces that can be rearranged into different shapes.\",\n    \"Formal Language\": \"Stomachion \\in Puzzle \\cap Mathematics\"\n}\n```",
    "```json\n{\n    \"Name\": \"T-Puzzle\",\n    \"Definition\": \"A T-Puzzle is a dissection puzzle where the goal is to fit a set of given pieces together to form a T-shape.\",\n    \"Formal Language\": \"T-Puzzle \\in Puzzle\"\n}\n```",
    "```json\n{\n    \"Name\": \"Tangram\",\n    \"Definition\": \"A tangram is a traditional Chinese puzzle consisting of a square cut into seven pieces that can be arranged to make various shapes.\",\n    \"Formal Language\": \"Tangram \\in Puzzle\"\n}\n```",
    "{\n    \"Name\": \"Tangram Paradox\",\n    \"Definition\": \"The Tangram Paradox is a visual puzzle involving a rearrangement of geometric pieces that seemingly change the area or shape, often leading to a paradoxical effect where the same pieces fill different figures.\",\n    \"Formal Language\": \"Tangram Paradox \\subseteq Geometry \\wedge Puzzles\"\n}",
    "```json\n{\n    \"Name\": \"Dissection\",\n    \"Definition\": \"The process of dividing a geometric figure into smaller parts, often to study its properties or to find its area or volume.\",\n    \"Formal Language\": \"Dissection \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Triangle Dissection\",\n    \"Definition\": \"The process of dividing a triangle into smaller triangles or other geometric shapes, often used to explore properties of triangles or solve geometric problems.\",\n    \"Formal Language\": \"Triangle Dissection \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Dissection Puzzles\",\n    \"Definition\": \"Puzzles involving the cutting of a geometric figure into pieces that can be rearranged to form another figure.\",\n    \"Formal Language\": \"Dissection Puzzle \\in Geometry\"\n}",
    "```json\n{\n    \"Name\": \"Sphere\",\n    \"Definition\": \"A three-dimensional geometrical shape, every point on its surface is equidistant from its center.\",\n    \"Formal Language\": \"Sphere \\in Geometric Shapes\"\n}\n```",
    "```json\n{\n    \"Name\": \"Spheroid\",\n    \"Definition\": \"A spheroid is a three-dimensional surface obtained by rotating an ellipse about one of its principal axes. It can be either oblate (flattened at the poles) or prolate (elongated along the axis of rotation).\",\n    \"Formal Language\": \"Spheroid \\subseteq \\mathbb{R}^3\"\n}\n```",
    "```json\n{\n    \"Name\": \"Cone\",\n    \"Definition\": \"A three-dimensional geometric shape that tapers smoothly from a flat, round base to a point called the apex or vertex.\",\n    \"Formal Language\": \"Cone \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Oblate Spheroid\",\n    \"Definition\": \"An oblate spheroid is a surface of revolution obtained by rotating an ellipse about its minor axis. It is a type of ellipsoid with two equal equatorial radii larger than the polar radius.\",\n    \"Formal Language\": \"Oblate Spheroid \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Double Cone\",\n    \"Definition\": \"A geometric shape consisting of two identical cones placed base to base.\",\n    \"Formal Language\": \"Double Cone \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Torus\",\n    \"Definition\": \"A surface or three-dimensional shape generated by revolving a circle in three-dimensional space about an axis coplanar with the circle.\",\n    \"Formal Language\": \"Torus \\subset \\mathbb{R}^3\"\n}\n```",
    "```json\n{\n    \"Name\": \"Solid of Revolution\",\n    \"Definition\": \"A three-dimensional shape formed by rotating a two-dimensional region around an axis.\",\n    \"Formal Language\": \"Solid of Revolution \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Cone Net\",\n    \"Definition\": \"A 2D representation that can be folded to form a 3D cone. It typically includes a circle for the base and a sector of a larger circle for the lateral surface.\",\n    \"Formal Language\": \"Cone Net \\in Geometric Construction\"\n}",
    "```json\n{\n    \"Name\": \"Cylinder\",\n    \"Definition\": \"A three-dimensional geometric shape with two parallel circular bases connected by a curved surface.\",\n    \"Formal Language\": \"Cylinder \\in GeometricSolid\"\n}\n```",
    "```json\n{\n    \"Name\": \"Plane\",\n    \"Definition\": \"A flat, two-dimensional surface that extends infinitely far\",\n    \"Formal Language\": \"Plane \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Altitude Plane\",\n    \"Definition\": \"An altitude in a triangle is a segment from a vertex perpendicular to the line containing the opposite side (the base) of the triangle. The plane in which this altitude lies is commonly referred to as the 'altitude plane'.\",\n    \"Formal Language\": \"AltitudePlane \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Euclidean Plane\",\n    \"Definition\": \"A two-dimensional space defined by a Cartesian coordinate system, where points are specified by pairs of numbers (coordinates).\",\n    \"Formal Language\": \"Euclidean Plane \\in \\mathbb{R}^2\"\n}\n```",
    "```json\n{\n    \"Name\": \"Perpendicular\",\n    \"Definition\": \"Two lines or segments are perpendicular if they intersect at a right angle (90 degrees).\",\n    \"Formal Language\": \"Perpendicular \\in Geometry, where lines or segments intersect at 90°\"\n}\n```",
    "```json\n{\n    \"Name\": \"Half-Plane\",\n    \"Definition\": \"A half-plane is one of the two parts into which a plane is divided by a straight line (the edge or boundary line) on the plane.\",\n    \"Formal Language\": \"Half-Plane \\subseteq Plane\"\n}\n```",
    "```json\n{\n    \"Name\": \"Conic Section\",\n    \"Definition\": \"A conic section is a curve obtained by intersecting a cone with a plane. The three main types are ellipses, parabolas, and hyperbolas.\",\n    \"Formal Language\": \"Conic Section \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Coordinate Plane\",\n    \"Definition\": \"A two-dimensional surface on which points are plotted and located by their coordinates (x, y), typically divided into four quadrants by a horizontal and vertical axis.\",\n    \"Formal Language\": \"Coordinate Plane \\subset \\mathbb{R}^2\"\n}\n```",
    "```json\n{\n    \"Name\": \"Coplanar\",\n    \"Definition\": \"Points, lines, segments, or shapes that lie on the same plane.\",\n    \"Formal Language\": \"Coplanar \\subseteq \\text{Plane}\"\n}\n```",
    "{\n    \"Name\": \"Line-Plane Intersection\",\n    \"Definition\": \"The point or line where a line and a plane meet in three-dimensional space.\",\n    \"Formal Language\": \"Line-Plane Intersection \\in Geometry\"\n}",
    "```json\n{\n    \"Name\": \"Cross Section\",\n    \"Definition\": \"A cross section is the intersection of a solid and a plane. It is a two-dimensional shape obtained by cutting through an object, such as a three-dimensional geometric figure.\",\n    \"Formal Language\": \"Cross Section \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Dihedral Angle\",\n    \"Definition\": \"The angle between two intersecting planes.\",\n    \"Formal Language\": \"DihedralAngle \\in Radians \\cup Degrees\"\n}\n```",
    "```json\n{\n    \"Name\": \"Parallel Line and Plane\",\n    \"Definition\": \"In geometry, a line and a plane are parallel if they do not intersect, no matter how far they are extended in any direction.\",\n    \"Formal Language\": \"Line \\parallel Plane \\quad (L \\parallel P)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Parallel Planes\",\n    \"Definition\": \"Parallel planes are two planes in three-dimensional space that do not intersect.\",\n    \"Formal Language\": \"Two planes are parallel if they have the same normal vector or their normal vectors are scalar multiples of each other.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Capsule\",\n    \"Definition\": \"A three-dimensional geometric shape that consists of a cylinder with hemispherical ends.\",\n    \"Formal Language\": \"Capsule ∈ 3D Geometry\"\n}\n```",
    "{\n    \"Name\": \"Surface\",\n    \"Definition\": \"In geometry, a surface is the two-dimensional shape or boundary of a three-dimensional object.\",\n    \"Formal Language\": \"Surface \\in Geometry\"\n}",
    "```json\n{\n    \"Name\": \"Ellipsoid\",\n    \"Definition\": \"An ellipsoid is a three-dimensional surface, all of whose plane cross-sections are ellipses or circles.\",\n    \"Formal Language\": \"Ellipsoid \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Line Segment\",\n    \"Definition\": \"A part of a line that is bounded by two distinct end points\",\n    \"Formal Language\": \"Line Segment \\in Geometry\"\n}\n\n{\n    \"Name\": \"Range\",\n    \"Definition\": \"The set of output values of a function corresponding to its domain\",\n    \"Formal Language\": \"Range \\in Set\"\n}",
    "```json\n{\n    \"Name\": \"Line Bisector\",\n    \"Definition\": \"A line bisector is a line or segment that divides another line segment into two equal parts at a right angle.\",\n    \"Formal Language\": \"A line bisector intersects a segment at its midpoint.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Radial Line\",\n    \"Definition\": \"A line segment that joins the center of a circle with any point on its circumference, often used in the context of geometry to describe parts of circles and other circular shapes.\",\n    \"Formal Language\": \"Radial Line \\subseteq Circle\"\n}\n```",
    "```json\n{\n    \"Name\": \"Ray\",\n    \"Definition\": \"A ray is a part of a line that starts at one point (called the endpoint) and extends infinitely in one direction.\",\n    \"Formal Language\": \"Ray \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Circle-Line Intersection\",\n    \"Definition\": \"The Circle-Line Intersection refers to the points at which a straight line intersects a circle, which can result in two points, one point (a tangent), or no intersection point.\",\n    \"Formal Language\": \"Circle-Line Intersection \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Coincident Lines\",\n    \"Definition\": \"Two or more lines that lie exactly on top of each other, sharing all their points in common.\",\n    \"Formal Language\": \"If Lines L1, L2: L1 = L2 \\implies \\forall p \\in L1 \\rightarrow p \\in L2\"\n}\n```",
    "```json\n{\n    \"Name\": \"Collinear\",\n    \"Definition\": \"Points that lie on the same straight line.\",\n    \"Formal Language\": \"Collinear \\iff \\exists \\, line \\, L \\, \\text{such that all points are on } L\"\n}\n```",
    "```json\n{\n    \"Name\": \"Line-Line Intersection\",\n    \"Definition\": \"The point at which two lines in a plane meet or cross each other.\",\n    \"Formal Language\": \"Intersection \\in Geometric Points\"\n}\n```",
    "```json\n{\n    \"Name\": \"Secant Line\",\n    \"Definition\": \"A line that intersects a curve at two or more points. It is used to approximate the slope of the curve between the points.\",\n    \"Formal Language\": \"Secant Line \\in Geometry \\text{ and } Calculus\"\n}\n```",
    "```json\n{\n    \"Name\": \"Cross\",\n    \"Definition\": \"Cross multiplication is a method used to solve equations that involve two fractions separated by an equal sign.\",\n    \"Formal Language\": \"Cross Multiplication: If a/b = c/d, then ad = bc\"\n}\n```",
    "```json\n{\n    \"Name\": \"Line Segment\",\n    \"Definition\": \"A part of a line that is bounded by two distinct end points, and contains every point on the line between its endpoints.\",\n    \"Formal Language\": \"Line Segment = \\{ x \\mid x \\in Line, x \\text{ is between two endpoints} \\}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Skew Lines\",\n    \"Definition\": \"In three-dimensional geometry, skew lines are two lines that do not intersect and are not parallel. They exist in different planes.\",\n    \"Formal Language\": \"Skew Lines \\subseteq \\mathbb{R}^3\"\n}\n```",
    "```json\n{\n    \"Name\": \"Midpoint\",\n    \"Definition\": \"The point that is exactly halfway between two other points on a line segment.\",\n    \"Formal Language\": \"Midpoint = ((x1 + x2)/2, (y1 + y2)/2) for two points (x1, y1) and (x2, y2)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Ellipse-Line Intersection\",\n    \"Definition\": \"The points at which a line crosses or touches an ellipse. These solutions can range from zero to two intersection points depending on the position of the line relative to the ellipse.\",\n    \"Formal Language\": \"Intersection(Ellipse, Line) = {P ∈ ℝ^2 | P satisfies both the ellipse and line equations}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Space Diagonal\",\n    \"Definition\": \"A space diagonal of a three-dimensional figure is a line segment that connects two vertices that are not on the same face. For example, in a rectangular prism, a space diagonal would extend from one corner of the prism to the opposite corner across the interior of the prism.\",\n    \"Formal Language\": \"Space Diagonal \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Face Diagonal\",\n    \"Definition\": \"A face diagonal is a line segment connecting two opposite corners (vertices) of a polygonal face of a polyhedron.\",\n    \"Formal Language\": \"FaceDiagonal \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Normal Line\",\n    \"Definition\": \"A normal line to a curve at a given point is the line perpendicular to the tangent line at that point.\",\n    \"Formal Language\": \"Normal Line \\perp Tangent Line \\, at \\, Point\"\n}\n```",
    "```json\n{\n    \"Name\": \"Orthogonal Lines\",\n    \"Definition\": \"Two lines that intersect at a right angle (90 degrees).\",\n    \"Formal Language\": \"For lines \\(L_1\\) and \\(L_2\\), \\(L_1 \\perp L_2\\) if their slopes are negative reciprocals, i.e., \\(m_1 \\times m_2 = -1\\)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Intersecting Lines\",\n    \"Definition\": \"Two or more lines that meet or cross each other at a single point.\",\n    \"Formal Language\": \"Intersecting Lines: If two lines l and m intersect at point P, then P is the intersection point of l and m. Mathematically, if line l and line m are represented as equations, their intersection point is the solution to the system of equations.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Transversal Line\",\n    \"Definition\": \"A transversal line is a line that passes through two or more other lines in the same plane at different points.\",\n    \"Formal Language\": \"Transversal \\in Geometry \\land \\exists \\; multiple \\; intersections\"\n}\n```",
    "```json\n{\n    \"Name\": \"Line\",\n    \"Definition\": \"In geometry, a straight path that has no thickness and extends forever in both directions.\",\n    \"Formal Language\": \"Line \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Perpendicular Bisector Theorem\",\n    \"Definition\": \"In a plane, if a point is on the perpendicular bisector of a segment, then it is equidistant from the endpoints of the segment.\",\n    \"Formal Language\": \"If point P is on the perpendicular bisector of segment AB, then PA = PB.\"\n}\n```",
    "{\n    \"Name\": \"Perpendicular Foot\",\n    \"Definition\": \"The point where a perpendicular line from a given point meets another line or plane.\",\n    \"Formal Language\": \"PerpendicularFoot \\in Geometry\"\n}",
    "```json\n{\n    \"Name\": \"Perpendicular Vector\",\n    \"Definition\": \"Two vectors are perpendicular if their dot product is zero, indicating they are at a 90-degree angle to each other.\",\n    \"Formal Language\": \"Two vectors, u and v, are perpendicular if u • v = 0\"\n}\n```",
    "```json\n{\n    \"Name\": \"Cathetus\",\n    \"Definition\": \"In a right triangle, a cathetus is one of the two sides that form the right angle, usually referred to as the 'legs' of the triangle.\",\n    \"Formal Language\": \"Cathetus \\in Geometry \\text{ (Triangle)}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Perpendicular Bisector\",\n    \"Definition\": \"A line which divides another line segment into two equal parts at 90 degrees.\",\n    \"Formal Language\": \"Perpendicular Bisector \\in Geometric Constructions\"\n}\n```",
    "```json\n{\n    \"Name\": \"Parallel Lines\",\n    \"Definition\": \"Two lines in a plane that do not intersect or meet, regardless of how far they are extended.\",\n    \"Formal Language\": \"Parallel Lines \\in Geometry: \\forall \\, x, \\, L_1 \\parallel L_2 \\Rightarrow \\neg \\exists \\, x \\, (x \\in L_1 \\cap x \\in L_2)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Inscribed\",\n    \"Definition\": \"A shape or figure is inscribed in another shape if it fits inside it, touching the outer shape at key points. For example, a circle is inscribed in a polygon if it touches all the sides of the polygon.\",\n    \"Formal Language\": \"Inscribed \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Intersection\",\n    \"Definition\": \"The intersection of two or more sets is the set of elements that are common to all sets.\",\n    \"Formal Language\": \"A ∩ B = {x | x ∈ A and x ∈ B}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Tangent Circles\",\n    \"Definition\": \"Tangent circles are two or more circles that intersect at exactly one point.\",\n    \"Formal Language\": \"Tangent Circles \\subset Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Concurrent\",\n    \"Definition\": \"In geometry, lines or curves that intersect at a single point are referred to as concurrent.\",\n    \"Formal Language\": \"Three or more lines are concurrent if there exists a point that is equidistant to all lines, denoted for lines l₁, l₂, ..., ln as ∃P: P \\in l₁ ∩ l₂ ∩ ... ∩ ln\"\n}\n```",
    "```json\n{\n    \"Name\": \"Tangent Externally\",\n    \"Definition\": \"Two circles are tangent externally if they touch each other at exactly one point and the circles do not intersect.\",\n    \"Formal Language\": \"Tangent_Externally(Circle_1, Circle_2) \\iff |Center_1 - Center_2| = Radius_1 + Radius_2\"\n}\n```",
    "```json\n{\n    \"Name\": \"Tangent Figures\",\n    \"Definition\": \"Figures or objects that touch or intersect each other at exactly one point. Most commonly discussed in the context of circles, where a tangent line intersects the circle at exactly one point.\",\n    \"Formal Language\": \"Tangent \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Tangent Internally\",\n    \"Definition\": \"A line that touches a circle or ellipse at exactly one point and lies within the shape, unlike a secant or external tangent.\",\n    \"Formal Language\": \"Internal Tangent \\equiv Line \\cap Circle = \\{P\\} \\land \\forall \\epsilon > 0, \\exists \\delta > 0 \\text{ such that } (0 < |x - x_0| < \\delta \\Rightarrow |f(x) - L| < \\epsilon), \\text{ where } L \\text{ is the tangent point } P.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Tangent Line\",\n    \"Definition\": \"A straight line that touches a curve at a single point without crossing it at that point.\",\n    \"Formal Language\": \"Tangent Line \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Parallel\",\n    \"Definition\": \"In geometry, parallel lines are lines in a plane that do not meet; they are always the same distance apart.\",\n    \"Formal Language\": \"Parallel \\in Geometry: Two lines l and m are parallel if they lie in the same plane and do not intersect, denoted by l || m.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Apothem\",\n    \"Definition\": \"The apothem is the line from the center of a regular polygon that is perpendicular to one of its sides.\",\n    \"Formal Language\": \"Apothem \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Chord\",\n    \"Definition\": \"A line segment with both endpoints on a circle.\",\n    \"Formal Language\": \"Chord \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Concentric Circles\",\n    \"Definition\": \"Concentric circles are circles with a common center, meaning they lie on the same plane and have varying radii.\",\n    \"Formal Language\": \"ConcentricCircles = {c1, c2, ..., cn | ci = (x - h)^2 + (y - k)^2 = ri^2, Center(h, k) \\in \\mathbb{R}^2, ri > 0, c1.Center = c2.Center = ... = cn.Center}\"\n}\n```",
    "{\n    \"Name\": \"Metric\",\n    \"Definition\": \"A metric is a function defined on a set that describes a distance between each pair of elements in the set.\",\n    \"Formal Language\": \"Metric: d(x, y) where d : S × S -> R, satisfying non-negativity, identity of indiscernibles, symmetry, and the triangle inequality\"\n}",
    "```json\n{\n    \"Name\": \"Euclidean Metric\",\n    \"Definition\": \"A metric defined on Euclidean space which measures the 'ordinary' straight-line distance between two points.\",\n    \"Formal Language\": \"d(x, y) = √((x_1 - y_1)^2 + (x_2 - y_2)^2 + ... + (x_n - y_n)^2), where x and y are points in n-dimensional space\"\n}\n```",
    "```json\n{\n    \"Name\": \"Scale Factor\",\n    \"Definition\": \"The ratio of any two corresponding lengths in two similar geometric figures. It is used to scale shapes proportionally.\",\n    \"Formal Language\": \"Scale Factor \\in Ratio\"\n}\n```",
    "```json\n{\n    \"Name\": \"Great Circle\",\n    \"Definition\": \"A great circle is the largest circle that can be drawn on a sphere, such that the plane containing the circle passes through the center of the sphere. It represents the shortest path between two points on the surface of the sphere.\",\n    \"Formal Language\": \"Great Circle \\in Geometry \\land Sphere \\in 3D Object\"\n}\n```",
    "```json\n{\n    \"Name\": \"Isometric\",\n    \"Definition\": \"A transformation that preserves distances and angles, meaning the original shape and the transformed shape are congruent.\",\n    \"Formal Language\": \"Isometric \\in Transformation: \\forall x, y \\in \\mathbb{R}^n, ||T(x) - T(y)|| = ||x - y||\"\n}\n```",
    "```json\n{\n    \"Name\": \"Angular Distance\",\n    \"Definition\": \"The measure of the angle between two points as observed from a specific point, often used in astronomy to define the apparent distance between celestial objects.\",\n    \"Formal Language\": \"Angular Distance \\in AngleMeasurement\"\n}\n```",
    "```json\n{\n    \"Name\": \"Surface Area\",\n    \"Definition\": \"The total area that the surface of a three-dimensional object occupies.\",\n    \"Formal Language\": \"Surface Area \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Planar Point\",\n    \"Definition\": \"A point located on a plane, defined by a pair of numerical coordinates, typically in two-dimensional space.\",\n    \"Formal Language\": \"Planar Point \\in \\mathbb{R}^2\"\n}\n```",
    "```json\n{\n    \"Name\": \"Arc Length\",\n    \"Definition\": \"The distance along a curved line making up part of the circumference of a circle.\",\n    \"Formal Language\": \"Arc Length = \\int_a^b \\sqrt{1 + \\left(\\frac{dy}{dx}\\right)^2} \\, dx\"\n}\n```",
    "```json\n{\n    \"Name\": \"Semiperimeter\",\n    \"Definition\": \"The semiperimeter of a polygon is half of its perimeter. For a triangle, it is calculated as the sum of its three sides divided by two.\",\n    \"Formal Language\": \"s = \\frac{a + b + c}{2} \\text{ for a triangle with sides } a, b, c\"\n}\n```",
    "```json\n{\n    \"Name\": \"Tangent Curves\",\n    \"Definition\": \"Tangent curves refer to lines or curves that touch a circle or a curve at just one point without crossing it, usually describing the tangent function graph in trigonometry.\",\n    \"Formal Language\": \"Tangent Curves \\in Trigonometry, Calculus\"\n}\n```",
    "```json\n{\n    \"Name\": \"Curve Length\",\n    \"Definition\": \"The total length of a curved line, which can be defined mathematically using calculus.\",\n    \"Formal Language\": \"Curve Length \\in \\mathbb{R}^+\"\n}\n```",
    "```json\n{\n    \"Name\": \"Cusp\",\n    \"Definition\": \"A point on a curve where the curve changes direction abruptly, typically characterized by a sharp point.\",\n    \"Formal Language\": \"A cusp is a type of singular point where a curve has two branches meeting at a point on a tangent line with the same direction.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Perimeter\",\n    \"Definition\": \"The total length of the sides or edges of a two-dimensional geometric figure.\",\n    \"Formal Language\": \"Perimeter \\in Measurement\"\n}\n```",
    "```json\n{\n    \"Name\": \"Radius of Curvature\",\n    \"Definition\": \"The radius of the circular arc which best approximates the curve at a particular point.\",\n    \"Formal Language\": \"R = \\\\frac{(1 + (\\\\frac{dy}{dx})^2)^{3/2}}{|\\\\frac{d^2y}{dx^2}|}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Cavalieri's Principle\",\n    \"Definition\": \"Cavalieri's Principle is a geometric principle that states if two solids in three-dimensional space have the same height and the same cross-sectional area at every level, then they have the same volume.\",\n    \"Formal Language\": \"Cavalieri's Principle: If \\(\\forall z \\in [a, b], A(z) = B(z)\\), then \\(V(A) = V(B)\\) where \\(A(z)\\) and \\(B(z)\\) are cross-sectional areas of solids A and B at height z.\"\n}\n```",
    "{\n    \"Name\": \"Volume\",\n    \"Definition\": \"The amount of space occupied by a three-dimensional object, measured in cubic units.\",\n    \"Formal Language\": \"Volume \\in Measurement \\space \\mathbb{R}\"\n}",
    "```json\n{\n    \"Name\": \"Volume Theorem\",\n    \"Definition\": \"The volume theorem is a general principle used in geometry to calculate the volume of certain geometrical shapes or solids.\",\n    \"Formal Language\": \"Volume \\in Measurement \\wedge Theorems \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Spherical Cap\",\n    \"Definition\": \"A spherical cap is a portion of a sphere cut off by a plane. It is essentially the 'cap' or 'lid' that results from slicing a sphere with a flat surface.\",\n    \"Formal Language\": \"Spherical Cap \\subseteq Sphere\"\n}",
    "```json\n{\n    \"Name\": \"Spherical Segment\",\n    \"Definition\": \"A spherical segment is the solid defined by cutting a sphere with a pair of parallel planes. It is a portion of a sphere that lies between two parallel planes which may or may not pass through the sphere's center.\",\n    \"Formal Language\": \"Spherical Segment \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Globe\",\n    \"Definition\": \"A spherical model of Earth or any celestial body, often used to represent maps of geographical locations.\",\n    \"Formal Language\": \"Globe \\in Model\"\n}\n```",
    "```json\n{\n    \"Name\": \"Radius\",\n    \"Definition\": \"The distance from the center of a circle to any point on its circumference.\",\n    \"Formal Language\": \"Radius \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Spherical Shell\",\n    \"Definition\": \"A three-dimensional region between two concentric spheres of different radii.\",\n    \"Formal Language\": \"Spherical Shell \\subset \\mathbb{R}^3\"\n}\n```",
    "```json\n{\n    \"Name\": \"Hemisphere\",\n    \"Definition\": \"Half of a sphere, typically divided into northern and southern halves or eastern and western halves.\",\n    \"Formal Language\": \"Hemisphere \\subset Sphere\"\n}\n```",
    "```json\n{\n    \"Name\": \"Small Circle\",\n    \"Definition\": \"In the context of a sphere, a small circle is a circle on the surface of the sphere, formed by the intersection of the sphere with a plane that does not pass through the center of the sphere.\",\n    \"Formal Language\": \"Small Circle \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Unit Ball\",\n    \"Definition\": \"In mathematics, the unit ball is the set of all points in a given space that are within a fixed distance, known as the radius, from a central point, typically the origin, where the radius is equal to one.\",\n    \"Formal Language\": \"UnitBall = { x ∈ ℝ^n : ||x|| ≤ 1 }\"\n}\n```",
    "```json\n{\n    \"Name\": \"Unit Sphere\",\n    \"Definition\": \"A sphere with a radius of 1, typically centered at the origin in a coordinate system.\",\n    \"Formal Language\": \"Unit Sphere \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Dipyramid\",\n    \"Definition\": \"A three-dimensional geometric shape formed by joining two identical pyramids base to base. A dipyramid is a type of polyhedron.\",\n    \"Formal Language\": \"Dipyramid \\in Polyhedron\"\n}\n```",
    "```json\n{\n    \"Name\": \"Hexagonal Pyramid\",\n    \"Definition\": \"A three-dimensional geometric shape with a hexagonal base and triangular faces that meet at a single point, called the apex.\",\n    \"Formal Language\": \"Hexagonal Pyramid \\in Polyhedron \\wedge Base \\in Hexagon \\wedge Faces \\in Triangle\"\n}\n```",
    "```json\n{\n    \"Name\": \"Pyramid\",\n    \"Definition\": \"A polyhedron whose base is a polygon and whose lateral faces are triangles that meet at a common point called the apex.\",\n    \"Formal Language\": \"Pyramid \\in Polyhedron\"\n}\n```",
    "```json\n{\n    \"Name\": \"Pyramidal Frustum\",\n    \"Definition\": \"A pyramidal frustum is a portion of a pyramid that is obtained by cutting the top with a plane parallel to the base, which removes the apex.\",\n    \"Formal Language\": \"Pyramidal Frustum \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Regular Pyramid\",\n    \"Definition\": \"A pyramid with a base that is a regular polygon and whose apex is vertically above the center of the base.\",\n    \"Formal Language\": \"Regular Pyramid \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Right Pyramid\",\n    \"Definition\": \"A pyramid with a base that is a regular polygon and an apex that is directly above the center of the base.\",\n    \"Formal Language\": \"Right Pyramid \\subset Pyramid\"\n}\n```",
    "```json\n{\n    \"Name\": \"Square Pyramid\",\n    \"Definition\": \"A three-dimensional geometric figure with a square base and four triangular faces that meet at a common point (the apex).\",\n    \"Formal Language\": \"Square Pyramid \\in Polyhedron\"\n}\n```",
    "```json\n{\n    \"Name\": \"Triangular Pyramid\",\n    \"Definition\": \"A three-dimensional geometric figure with a triangular base and three triangular faces that meet at a single point (vertex).\",\n    \"Formal Language\": \"Triangular Pyramid \\in Polyhedron\"\n}\n```",
    "{\n    \"Name\": \"Truncated Square Pyramid\",\n    \"Definition\": \"A truncated square pyramid is a three-dimensional geometric solid with two parallel square bases of different sizes and trapezoidal lateral faces connecting the corresponding vertices of the two bases.\",\n    \"Formal Language\": \"Truncated Square Pyramid \\in Geometric Solids\"\n}",
    "```json\n{\n    \"Name\": \"Icosahedron\",\n    \"Definition\": \"A polyhedron with 20 faces, each of which is an equilateral triangle.\",\n    \"Formal Language\": \"Icosahedron \\in Polyhedron\"\n}\n```",
    "```json\n{\n    \"Name\": \"Simple Polyhedron\",\n    \"Definition\": \"A three-dimensional shape consisting of flat polygonal surfaces, straight edges, and vertices, characterized by Euler's formula V - E + F = 2 for simple polyhedra, where V is the number of vertices, E is the number of edges, and F is the number of faces.\",\n    \"Formal Language\": \"Simple Polyhedron \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Octahedron\",\n    \"Definition\": \"An octahedron is a three-dimensional shape having eight equilateral triangular faces, six vertices, and twelve edges.\",\n    \"Formal Language\": \"Octahedron \\in Polyhedron\"\n}\n```",
    "```json\n{\n    \"Name\": \"Convex Polyhedron\",\n    \"Definition\": \"A three-dimensional solid where all interior angles are less than 180 degrees, and the line segment joining any two points in the polyhedron lies entirely inside or on the polyhedron.\",\n    \"Formal Language\": \"Convex Polyhedron \\in Geometry \\land V - E + F = 2\"\n}\n```",
    "```json\n{\n    \"Name\": \"Origami\",\n    \"Definition\": \"The Japanese art of folding paper into decorative shapes and figures, often used in education to teach spatial reasoning and geometry.\",\n    \"Formal Language\": \"Origami \\in Art \\wedge Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Cuboid\",\n    \"Definition\": \"A three-dimensional geometric figure bounded by six rectangular faces, with opposite faces being identical.\",\n    \"Formal Language\": \"Cuboid \\in \\mathbb{R}^3\"\n}\n```",
    "```json\n{\n    \"Name\": \"Pentahedron\",\n    \"Definition\": \"A polyhedron with five faces.\",\n    \"Formal Language\": \"Pentahedron \\in 3D Geometric Shapes\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polyhedron\",\n    \"Definition\": \"A three-dimensional solid figure with flat polygonal faces, straight edges, and vertices.\",\n    \"Formal Language\": \"Polyhedron \\subseteq \\mathbb{R}^3\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polyhedron Diagonal\",\n    \"Definition\": \"A line segment connecting two non-adjacent vertices of a polyhedron.\",\n    \"Formal Language\": \"Diagonal(P) \\in Polyhedron\"\n}\n```",
    "```json\n{\n    \"Name\": \"Dodecahedron\",\n    \"Definition\": \"A three-dimensional solid shape that has twelve flat faces, each a regular pentagon.\",\n    \"Formal Language\": \"Dodecahedron \\in Platonic Solids\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polyhedron Edge\",\n    \"Definition\": \"A line segment formed by the intersection of two polygonal faces of a polyhedron.\",\n    \"Formal Language\": \"Edge \\in Polyhedron\"\n}\n```",
    "```json\n{\n    \"Name\": \"Geodesic Dome\",\n    \"Definition\": \"A spherical or partial-spherical structure composed of a network of triangles that distribute stress and provide structural strength.\",\n    \"Formal Language\": \"Geodesic Dome \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Heptahedron\",\n    \"Definition\": \"A polyhedron with seven faces.\",\n    \"Formal Language\": \"Heptahedron \\in Polyhedron\"\n}",
    "```json\n{\n    \"Name\": \"Wedge\",\n    \"Definition\": \"A wedge is a simple machine that consists of a piece of material that is thick at one end and tapers to a thin edge at the other, often used to cut or split objects.\",\n    \"Formal Language\": \"Wedge \\in Simple Machines\"\n}\n```",
    "```json\n{\n    \"Name\": \"Cube\",\n    \"Definition\": \"A number raised to the third power, or a three-dimensional solid object with six equal square faces.\",\n    \"Formal Language\": \"Cube \\in Number^3 \\lor Cube \\in SolidGeometry\"\n}\n```",
    "{\n    \"Name\": \"Antiprism\",\n    \"Definition\": \"An antiprism is a geometric shape that consists of two parallel copies of a polygon, connected by an alternating band of triangles. Antiprisms are the 3D counterpart structures to prisms, differing mainly by their triangular lateral faces, which rotate the top polygon with respect to the bottom.\",\n    \"Formal Language\": \"Antiprism \\in Geometry\"\n}",
    "```json\n{\n    \"Name\": \"Hexagonal Prism\",\n    \"Definition\": \"A three-dimensional geometric figure with two parallel and congruent hexagonal bases and rectangular lateral faces connecting corresponding sides of the bases.\",\n    \"Formal Language\": \"Hexagonal Prism \\in Solid Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Octagonal Prism\",\n    \"Definition\": \"A three-dimensional solid object which has two parallel congruent octagonal bases and rectangular lateral faces.\",\n    \"Formal Language\": \"Octagonal Prism \\in Polyhedron\"\n}\n```",
    "{\n    \"Name\": \"Pentagonal Prism\",\n    \"Definition\": \"A three-dimensional solid with two parallel and congruent pentagonal bases and rectangular faces connecting the corresponding sides of the pentagons.\",\n    \"Formal Language\": \"Pentagonal Prism \\in 3D Geometric Solids\"\n}",
    "```json\n{\n    \"Name\": \"Pentagonal Pyramid\",\n    \"Definition\": \"A three-dimensional geometric figure with a pentagonal base and triangular faces that converge at a single point called the apex.\",\n    \"Formal Language\": \"Pentagonal Pyramid \\in Polyhedra\"\n}\n```",
    "```json\n{\n    \"Name\": \"Prism\",\n    \"Definition\": \"A three-dimensional geometric shape with two parallel and congruent polygonal bases connected by rectangular faces.\",\n    \"Formal Language\": \"Prism \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Triangular Prism\",\n    \"Definition\": \"A three-dimensional geometric shape with two parallel, congruent triangular bases and rectangular faces connecting the corresponding sides.\",\n    \"Formal Language\": \"Triangular Prism \\in 3D Geometric Shapes\"\n}\n```",
    "```json\n{\n    \"Name\": \"Regular Polyhedron\",\n    \"Definition\": \"A three-dimensional shape with all faces being congruent regular polygons and the same number of faces meeting at each vertex.\",\n    \"Formal Language\": \"Regular Polyhedron \\in 3D Geometry\"\n}\n```",
    "{\n    \"Name\": \"Face\",\n    \"Definition\": \"A flat surface that forms part of the boundary of a solid object, typically referred to in the context of polyhedra (e.g., cubes, pyramids).\",\n    \"Formal Language\": \"Face \\in Geometry\"\n}",
    "```json\n{\n    \"Name\": \"Facet\",\n    \"Definition\": \"A face of a geometric shape, typically a flat surface of a polyhedron.\",\n    \"Formal Language\": \"Facet \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polyhedral Formula\",\n    \"Definition\": \"A formula stating that for any convex polyhedron, the number of vertices and faces together is exactly two more than the number of edges.\",\n    \"Formal Language\": \"V - E + F = 2, where V is the number of vertices, E is the number of edges, and F is the number of faces of the polyhedron.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polyhedron Coloring\",\n    \"Definition\": \"Polyhedron coloring refers to the method of coloring the faces of a polyhedron such that no two adjacent faces have the same color. This concept is often tied to graph theory and is an extension of the map coloring problem.\",\n    \"Formal Language\": \"Polyhedron Coloring \\in Combinatorics\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polyhedron Vertex\",\n    \"Definition\": \"A vertex of a polyhedron is a point where three or more edges meet.\",\n    \"Formal Language\": \"Vertex \\in Polyhedron, Vertex = Intersection(Edges)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Elongated Triangular Pyramid\",\n    \"Definition\": \"A three-dimensional geometric shape, a type of elongated pyramid where the base is a triangular prism and the side faces are triangles that meet at a single point (vertex) not in the plane of the base.\",\n    \"Formal Language\": \"Elongated Triangular Pyramid \\in Polyhedra\"\n}\n```",
    "```json\n{\n    \"Name\": \"Elongated Pentagonal Pyramid\",\n    \"Definition\": \"A three-dimensional geometric solid consisting of a pentagonal pyramid attached to a pentagonal prism base.\",\n    \"Formal Language\": \"Elongated Pentagonal Pyramid \\in Solid Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Elongated Pyramid\",\n    \"Definition\": \"An elongated pyramid is a three-dimensional geometric shape that consists of a pyramid with an elongated base, typically created by extending the base shape to form a prism, then capping it with a pyramid.\",\n    \"Formal Language\": \"An elongated pyramid is the combination of a prism and a pyramid, based on polygonal geometry.\"\n}\n```",
    "{\n    \"Name\": \"Elongated Square Pyramid\",\n    \"Definition\": \"A polyhedron consisting of a square base, four triangular lateral faces, and an additional pyramid truncated on top of a square base. It looks like a square pyramid with an additional layer of square prisms between the base and the apex.\",\n    \"Formal Language\": \"Elongated Square Pyramid \\in Polyhedra\"\n}",
    "```json\n{\n    \"Name\": \"Medial Parallelogram\",\n    \"Definition\": \"A medial parallelogram is the parallelogram formed by joining the midpoints of the sides of a quadrilateral. It is always a parallelogram, even if the original quadrilateral is not.\",\n    \"Formal Language\": \"Medial \\in Quadrilateral \\rightarrow Parallelogram\"\n}\n```",
    "```json\n{\n    \"Name\": \"Tetrahedron\",\n    \"Definition\": \"A three-dimensional geometric shape with four triangular faces, six edges, and four vertices.\",\n    \"Formal Language\": \"Tetrahedron \\subseteq Polyhedron\"\n}\n```",
    "```json\n{\n    \"Name\": \"Regular Tetrahedron\",\n    \"Definition\": \"A three-dimensional shape with four equilateral triangular faces, six equal edges, and four vertices.\",\n    \"Formal Language\": \"Regular Tetrahedron \\in Polyhedron \\cap Regular polyhedron\"\n}\n```",
    "```json\n{\n    \"Name\": \"Stellation\",\n    \"Definition\": \"Stellation is a process by which new figures are constructed from a given polytope by extending its elements (faces, edges, etc.) until they meet to form a new polytope.\",\n    \"Formal Language\": \"Stellation \\subseteq Polytope \\rightarrow New \\, Polytope\"\n}\n```",
    "```json\n{\n    \"Name\": \"Truncated Polyhedron\",\n    \"Definition\": \"A polyhedron that has had one or more of its vertices cut off, resulting in new faces replacing the cut vertices.\",\n    \"Formal Language\": \"Truncated Polyhedron \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Unfolding\",\n    \"Definition\": \"Unfolding in mathematics often refers to a technique that essentially 'expands' an iterative process or a recursive structure into a non-recursive one. It can also refer to the process of expanding a higher-dimensional object into a lower-dimensional space.\",\n    \"Formal Language\": \"Unfolding \\in Mathematical Techniques\"\n}\n```",
    "```json\n{\n    \"Name\": \"Regular Dodecahedron\",\n    \"Definition\": \"A regular dodecahedron is a three-dimensional shape that has 12 regular pentagonal faces, 30 edges, and 20 vertices.\",\n    \"Formal Language\": \"Regular Dodecahedron \\in Polyhedra\"\n}\n```",
    "{\n    \"Name\": \"Regular Icosahedron\",\n    \"Definition\": \"A three-dimensional geometric solid, also known as a Platonic solid, with 20 identical equilateral triangular faces, 30 edges, and 12 vertices.\",\n    \"Formal Language\": \"Regular Icosahedron \\in Polyhedron\"\n}",
    "```json\n{\n    \"Name\": \"Regular Octahedron\",\n    \"Definition\": \"A regular octahedron is a three-dimensional shape with eight equilateral triangular faces, six vertices, and twelve edges, where all faces are congruent regular triangles.\",\n    \"Formal Language\": \"Regular Octahedron \\in Polyhedra\"\n}\n```",
    "{\n    \"Name\": \"Platonic Solid\",\n    \"Definition\": \"A Platonic solid is a three-dimensional shape with identical faces that are congruent regular polygons and the same number of faces meeting at each vertex.\",\n    \"Formal Language\": \"PlatonicSolid \\subset Polyhedron\"\n}",
    "```json\n{\n    \"Name\": \"Pentacube\",\n    \"Definition\": \"A three-dimensional geometric figure made from five connected cubes of equal size.\",\n    \"Formal Language\": \"Pentacube \\in 3D Geometric Shapes\"\n}\n```",
    "```json\n{\n    \"Name\": \"Unit Cube\",\n    \"Definition\": \"A cube whose sides are 1 unit in length, used as a reference or standard measurement in geometry and volume calculations.\",\n    \"Formal Language\": \"Unit Cube \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Hexahedron\",\n    \"Definition\": \"A polyhedron with six faces. The most common example is a cube, where all faces are squares.\",\n    \"Formal Language\": \"Hexahedron \\in Polyhedron\"\n}\n```",
    "```json\n{\n    \"Name\": \"Parallelepiped\",\n    \"Definition\": \"A three-dimensional geometric figure with six faces (parallelograms), opposite pairs of which are parallel and congruent.\",\n    \"Formal Language\": \"Parallelepiped \\in SolidGeometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Archimedean Solid\",\n    \"Definition\": \"A semi-regular convex polyhedron composed of two or more types of regular polygons meeting in identical vertices.\",\n    \"Formal Language\": \"Archimedean Solid \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Cuboctahedron\",\n    \"Definition\": \"A polyhedron with 8 triangular faces and 6 square faces, forming a structure that is a member of the Archimedean solids.\",\n    \"Formal Language\": \"Cuboctahedron \\in Polyhedron\"\n}\n```",
    "{\n    \"Name\": \"Truncated Icosahedron\",\n    \"Definition\": \"A truncated icosahedron is a type of Archimedean solid made by truncating (or cutting) off the vertices of an icosahedron, resulting in a shape with 12 regular pentagonal faces, 20 regular hexagonal faces, 60 vertices, and 90 edges.\",\n    \"Formal Language\": \"Truncated Icosahedron \\in Archimedean Solids\"\n}",
    "```json\n{\n    \"Name\": \"General Prismatoid\",\n    \"Definition\": \"A three-dimensional polyhedron with all its vertices in two parallel planes, typically with polygonal bases which may differ, and faces that are trapezoids.\",\n    \"Formal Language\": \"General_Prismatoid \\in Polyhedra\"\n}\n```",
    "```json\n{\n    \"Name\": \"Height\",\n    \"Definition\": \"Height is the measurement of vertical distance, typically from the base of an object to its top.\",\n    \"Formal Language\": \"Height \\in \\mathbb{R}^+\"\n}\n```",
    "```json\n{\n    \"Name\": \"Length\",\n    \"Definition\": \"The measurement of the extent of something along its greatest dimension.\",\n    \"Formal Language\": \"Length \\in Measurement\"\n}\n```",
    "```json\n{\n    \"Name\": \"Section\",\n    \"Definition\": \"A line that divides a geometric figure into two parts or a distinct part of a book or document.\",\n    \"Formal Language\": \"Section \\in Geometry \\cup Literature\"\n}\n```",
    "```json\n{\n    \"Name\": \"Slant Height\",\n    \"Definition\": \"The slant height is the diagonal distance from the apex to the base (not the edge) of a cone or pyramid along its lateral surface.\",\n    \"Formal Language\": \"Slant Height \\in LinearMeasure\"\n}\n```",
    "```json\n{\n    \"Name\": \"Solid\",\n    \"Definition\": \"A three-dimensional geometric figure with width, depth, and height, like a cube or a sphere.\",\n    \"Formal Language\": \"Solid \\in Three\\text{-}Dimensional\\ Geometric\\ Figure\"\n}\n```",
    "```json\n{\n    \"Name\": \"Solid Geometry\",\n    \"Definition\": \"The study of three-dimensional shapes and the properties and relationships of these geometric forms, including volume, surface area, and the spatial relationships between different solids.\",\n    \"Formal Language\": \"SolidGeometry \\subseteq Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Width\",\n    \"Definition\": \"The measure of the extent of something from side to side, often used to describe the dimension of an object.\",\n    \"Formal Language\": \"Width \\in Measurement\"\n}\n```",
    "```json\n{\n    \"Name\": \"Conical Frustum\",\n    \"Definition\": \"A conical frustum is a three-dimensional geometric shape obtained by slicing the top off a cone parallel to its base, resulting in two circular ends of different sizes.\",\n    \"Formal Language\": \"Conical Frustum \\in Geometric Solids\"\n}\n```",
    "```json\n{\n    \"Name\": \"Grid Shading Problem\",\n    \"Definition\": \"A type of combinatorial problem that involves shading or coloring certain squares in a grid according to given rules.\",\n    \"Formal Language\": \"Grid Shading Problem \\in Combinatorial Problems\"\n}\n```",
    "{\n    \"Name\": \"Ball\",\n    \"Definition\": \"A 3-dimensional shape that is perfectly round, like a sphere, but should not be confused with the geometrical term 'sphere'. In geometry, the term 'ball' typically refers to the region or space enclosed by a sphere.\",\n    \"Formal Language\": \"Ball \\subset \\mathbb{R}^n\"\n}",
    "```json\n{\n    \"Name\": \"Circle-Circle Intersection\",\n    \"Definition\": \"The set of points that are common to two circles.\",\n    \"Formal Language\": \"Circle-Circle Intersection \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Circular Segment\",\n    \"Definition\": \"A circular segment is the region of a circle bounded by a chord and the arc that the chord subtends.\",\n    \"Formal Language\": \"Circular\\ Segment \\subseteq Circle\"\n}\n```",
    "```json\n{\n    \"Name\": \"Tangent\",\n    \"Definition\": \"In trigonometry, the tangent of an angle in a right-angled triangle is the ratio of the length of the opposite side to the adjacent side. In terms of circles and curves, a tangent line is a straight line that touches a curve at a single point without crossing it there.\",\n    \"Formal Language\": \"Tangent \\in TrigonometricFunctions \\cup Calculus\"\n}\n```",
    "```json\n{\n    \"Name\": \"Cosine\",\n    \"Definition\": \"Cosine is a trigonometric function that, in a right triangle, is the ratio of the length of the adjacent side to the length of the hypotenuse.\",\n    \"Formal Language\": \"cos(θ) = adjacent/hypotenuse, cos: θ \\in [0, 360°] → [-1, 1]\"\n}\n```",
    "{\n    \"Name\": \"Golden Spiral\",\n    \"Definition\": \"A logarithmic spiral that grows outward by a factor of the golden ratio for every quarter turn it makes.\",\n    \"Formal Language\": \"Golden Spiral: r = a * e^(bθ) where b = ln(φ)/(π/2) and φ is the golden ratio.\"\n}",
    "```json\n{\n    \"Name\": \"Golden Rectangle\",\n    \"Definition\": \"A golden rectangle is a rectangle whose side lengths are in the golden ratio, approximately 1.618:1.\",\n    \"Formal Language\": \"Golden Rectangle \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Golden Rhombus\",\n    \"Definition\": \"A rhombus in which the ratio of the diagonals is equal to the golden ratio, approximately 1.618.\",\n    \"Formal Language\": \"Golden Rhombus \\subset Rhombus, \\text{ where } \\frac{d_1}{d_2} = \\phi \\approx 1.618\"\n}\n```",
    "```json\n{\n    \"Name\": \"Obtuse Triangle\",\n    \"Definition\": \"A triangle in which one of the angles is greater than 90 degrees.\",\n    \"Formal Language\": \"Obtuse Triangle \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Polygon Circumscribing\",\n    \"Definition\": \"A polygon circumscribing a circle is one whereby each side of the polygon is tangent to the circle.\",\n    \"Formal Language\": \"Circumscription \\in Geometry\"\n}",
    "```json\n{\n    \"Name\": \"Polygon Inscribing\",\n    \"Definition\": \"A process of constructing a polygon inside a circle so that all vertices of the polygon touch the circle.\",\n    \"Formal Language\": \"Polygon Inscribing \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Pi\",\n    \"Definition\": \"Pi is the ratio of a circle's circumference to its diameter. It is approximately 3.14159 and is a mathematical constant.\",\n    \"Formal Language\": \"\\u03C0 \\equiv \\frac{C}{d} \\approx 3.14159\"\n}\n```",
    "```json\n{\n    \"Name\": \"Pi Formulas\",\n    \"Definition\": \"Mathematical formulas involving the constant π (pi), which represents the ratio of a circle's circumference to its diameter.\",\n    \"Formal Language\": \"Pi Formulas \\in Mathematics\"\n}\n```",
    "```json\n{\n    \"Name\": \"Congruence\",\n    \"Definition\": \"In geometry, congruence refers to the idea that two shapes are identical in form and size. In number theory, congruence involves a condition where two numbers give the same remainder when divided by a specific number.\",\n    \"Formal Language\": \"Congruence \\equiv \\mod\"\n}\n```",
    "{\n    \"Name\": \"Pythagoras's Theorem\",\n    \"Definition\": \"A fundamental relation in Euclidean geometry that relates the lengths of the sides of a right-angled triangle. It states that the square of the length of the hypotenuse is equal to the sum of the squares of the lengths of the other two sides.\",\n    \"Formal Language\": \"c^2 = a^2 + b^2, where c is the hypotenuse and a and b are the legs of a right triangle.\"\n}",
    "```json\n{\n    \"Name\": \"Congruent\",\n    \"Definition\": \"In geometry, two figures are congruent if they have the same shape and size, though their positions may be different.\",\n    \"Formal Language\": \"Congruent: \\u2245\"\n}\n```",
    "```json\n{\n    \"Name\": \"Frustum\",\n    \"Definition\": \"A frustum is a portion of a solid (normally a cone or pyramid) that lies between two parallel planes cutting through the solid.\",\n    \"Formal Language\": \"Frustum \\subset \\text{Solid Geometry}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Right Circular Cylinder\",\n    \"Definition\": \"A three-dimensional geometric shape with two parallel circular bases connected by a curved surface at a fixed distance from each other.\",\n    \"Formal Language\": \"Right Circular Cylinder \\in Solid Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Right Circular Cone\",\n    \"Definition\": \"A three-dimensional geometric shape with a circular base and a vertex that is perpendicular to the center of the base.\",\n    \"Formal Language\": \"Right Circular Cone \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Archimedes' Spiral\",\n    \"Definition\": \"A spiral named after the Ancient Greek mathematician Archimedes, characterized by the fact that the distance between its turns is constant.\",\n    \"Formal Language\": \"r = a + bθ, where r is the radial distance from the origin, θ is the angle, and a, b are constants.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polygonal Spiral\",\n    \"Definition\": \"A spiral that is composed of a series of connected polygons, each sharing a side with the next, typically creating a spiraling shape outward or inward.\",\n    \"Formal Language\": \"Polygonal Spiral \\in Geometric Shape\"\n}\n```",
    "```json\n{\n    \"Name\": \"Spiral\",\n    \"Definition\": \"A curve that starts from a point and moves progressively away from that point while circling around it.\",\n    \"Formal Language\": \"Spiral \\subseteq \\mathbb{R}^2\"\n}\n```",
    "```json\n{\n    \"Name\": \"Helix\",\n    \"Definition\": \"A type of smooth space curve with a constant radius and pitch, resembling a spring or spiral shape. It is a three-dimensional geometric shape.\",\n    \"Formal Language\": \"Helix \\in \\mathbb{R}^3\"\n}\n```",
    "{\n    \"Name\": \"Deltoid\",\n    \"Definition\": \"A deltoid is a quadrilateral with two pairs of adjacent sides that are equal in length. It is a type of kite shape.\",\n    \"Formal Language\": \"Deltoid \\subseteq Quadrilateral\"\n}",
    "```json\n{\n    \"Name\": \"Cardioid\",\n    \"Definition\": \"A cardioid is a heart-shaped curve traced by a point on the circumference of a circle that is rolling around a fixed circle of the same radius.\",\n    \"Formal Language\": \"Cardioid \\in Curve\"\n}\n```",
    "```json\n{\n    \"Name\": \"Reuleaux Triangle\",\n    \"Definition\": \"A Reuleaux triangle is a shape of constant width, made from equilateral triangle arcs. It is one of the simplest non-circular shapes that has the same breadth from any given direction.\",\n    \"Formal Language\": \"ReuleauxTriangle \\subseteq Set_{ConstantWidth}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Spirograph\",\n    \"Definition\": \"A device used to draw hypotrochoids and epitrochoids, which are mathematical curves formed by the motion of a circle rolling around another circle.\",\n    \"Formal Language\": \"Spirograph \\in Geometric Drawing\"\n}\n```",
    "```json\n{\n    \"Name\": \"Eccentricity\",\n    \"Definition\": \"Eccentricity is a measure of how much a conic section (such as an ellipse or hyperbola) deviates from being circular. For circles, the eccentricity is 0, whereas, for ellipses, it ranges between 0 and 1, and for parabolas and hyperbolas, it is 1 and greater than 1, respectively.\",\n    \"Formal Language\": \"Eccentricity (e) for conic sections where: e = c/a for ellipses and hyperbolas, with c being the distance from the center to the focus and a being the semi-major axis length.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Auxiliary Circle\",\n    \"Definition\": \"An auxiliary circle is a circle used in construction problems, particularly in geometry, to assist in the visualization or calculation of a geometric figure, such as the basis for transforming an ellipse into a circle through dilation.\",\n    \"Formal Language\": \"Auxiliary Circle \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Ellipse\",\n    \"Definition\": \"An ellipse is a geometric shape that looks like a flattened circle. It is defined as the locus of all points in a plane such that the sum of the distances to two fixed points (called the foci) is constant.\",\n    \"Formal Language\": \"Ellipse \\in Conic Section\"\n}\n```",
    "{\n    \"Name\": \"Parabola\",\n    \"Definition\": \"A symmetric curve formed by all points at a constant distance from a point called the focus and a line called the directrix.\",\n    \"Formal Language\": \"Parabola \\in Geometric shape\"\n}",
    "```json\n{\n    \"Name\": \"Circle\",\n    \"Definition\": \"A round plane figure whose boundary (the circumference) consists of points equidistant from a fixed point (the center).\",\n    \"Formal Language\": \"Circle \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Ellipse Tangent\",\n    \"Definition\": \"A line that touches an ellipse at exactly one point and is perpendicular to the radius at the point of contact.\",\n    \"Formal Language\": \"Tangent \\in Lines such that for point P on Ellipse, \\n\\tLine is perpendicular to the radius at P\"\n}\n```",
    "```json\n{\n    \"Name\": \"Parabolic Segment\",\n    \"Definition\": \"A region bounded by a parabola and a line segment, usually involving calculations of area under the parabola.\",\n    \"Formal Language\": \"Parabolic Segment \\subseteq \\mathbb{R}^2\"\n}\n```",
    "```json\n{\n    \"Name\": \"Focus\",\n    \"Definition\": \"In geometry, a focus is one of the fixed points from which the distances to any point of a given curve, such as an ellipse or a parabola, maintain a certain relationship.\",\n    \"Formal Language\": \"Focus \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Hyperbola\",\n    \"Definition\": \"A type of conic section that appears as two mirror-image curves; it is the set of all points for which the absolute difference of the distances to two fixed points (the foci) is constant.\",\n    \"Formal Language\": \"Hyperbola \\in ConicSection\"\n}\n```",
    "```json\n{\n    \"Name\": \"Semimajor Axis\",\n    \"Definition\": \"The longest diameter of an ellipse, which runs through its center and both foci, and extends to the periphery on either side.\",\n    \"Formal Language\": \"Semimajor Axis \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Conic Section Directrix\",\n    \"Definition\": \"In geometry, a directrix is a line such that the distance to it and to a point (the focus) maintain a constant ratio for points on a conic section. Specifically, for each point on a conic, the ratio of its distance from the focus to its distance from the directrix is a constant.\",\n    \"Formal Language\": \"Directrix \\in \\mathbb{R}^1 \\text{ related to conic sections: ellipse, parabola, hyperbola}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Semiminor Axis\",\n    \"Definition\": \"The shortest radius of an ellipse, running from the center of the ellipse to the edge, perpendicular to the semimajor axis.\",\n    \"Formal Language\": \"Semiminor Axis \\subseteq \\mathbb{R}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Latus Rectum\",\n    \"Definition\": \"The latus rectum of a conic section is the line segment that passes through a focus of the conic section, is parallel to the conic's directrix, and has both endpoints on the conic.\",\n    \"Formal Language\": \"Latus Rectum \\subseteq Conic\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polar Coordinates\",\n    \"Definition\": \"A coordinate system where each point on a plane is determined by an angle and a distance from a reference point.\",\n    \"Formal Language\": \"(r, θ) \\in ℝ²\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polar Plot\",\n    \"Definition\": \"A graph where each point on the plane is determined by an angle and a distance relative to the origin, commonly used to represent complex numbers and in trigonometry.\",\n    \"Formal Language\": \"Polar Plot \\in Coordinate System\"\n}\n```",
    "```json\n{\n    \"Name\": \"Lemniscate\",\n    \"Definition\": \"A lemniscate is a plane curve with a shape reminiscent of the figure-eight symbol (∞), often seen in polar coordinates.\",\n    \"Formal Language\": \"Lemniscate \\in \\mathbb{R}^2\"\n}\n```",
    "```json\n{\n    \"Name\": \"Spirolateral\",\n    \"Definition\": \"A spirolateral is a geometric figure created by drawing a series of connected straight lines that turn at a fixed angle after a set number of steps, eventually forming a closed loop or an open pattern.\",\n    \"Formal Language\": \"Spirolateral \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Square Inscribing\",\n    \"Definition\": \"The process of drawing one shape inside another so that the inner shape touches the outer shape at as many points as possible, typically referring to a square inside another figure.\",\n    \"Formal Language\": \"Inscribing \\in Geometry\"\n}",
    "{\n    \"Name\": \"Cartesian Curve\",\n    \"Definition\": \"A curve that is defined by a mathematical equation in a Cartesian coordinate system, where each point on the curve corresponds to a coordinate pair (x, y) that satisfies the equation.\",\n    \"Formal Language\": \"Cartesian Curve \\subseteq \\mathbb{R}^2\"\n}",
    "```json\n{\n    \"Name\": \"Oval\",\n    \"Definition\": \"A geometric shape that resembles a squished circle, typically defined as a closed curve on a plane with a long axis and a short axis.\",\n    \"Formal Language\": \"Oval \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Diamond\",\n    \"Definition\": \"In geometry, a diamond typically refers to a rhombus, which is a quadrilateral with all sides having equal length.\",\n    \"Formal Language\": \"Diamond \\equiv Rhombus \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Cubic Curve\",\n    \"Definition\": \"A cubic curve is a plane algebraic curve of degree three, defined by a polynomial equation of the form ax^3 + bx^2 + cx + d = 0, where a, b, c, and d are constants and a is non-zero.\",\n    \"Formal Language\": \"Cubic Curve \\in Algebraic Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Closed Curve\",\n    \"Definition\": \"A curve in a plane that starts and ends at the same point without crossing itself.\",\n    \"Formal Language\": \"Closed Curve \\subseteq \\mathbb{R}^2\"\n}\n```",
    "```json\n{\n    \"Name\": \"Curve\",\n    \"Definition\": \"A smooth, continuous line that can be straight or have a changing direction, often used in geometry and graphing.\",\n    \"Formal Language\": \"Curve \\subset \\mathbb{R}^2 \\text{ or } \\mathbb{R}^3\"\n}\n```",
    "```json\n{\n    \"Name\": \"Simple Curve\",\n    \"Definition\": \"A simple curve is a curve that does not intersect itself.\",\n    \"Formal Language\": \"SimpleCurve \\subseteq Curve\"\n}\n```",
    "```json\n{\n    \"Name\": \"Smooth Curve\",\n    \"Definition\": \"A curve that is differentiable everywhere and does not have any sharp corners or cusps.\",\n    \"Formal Language\": \"Smooth Curve \\subseteq \\mathbb{R}^n, \\text{where it is infinitely differentiable}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Circle Inscribing\",\n    \"Definition\": \"The process of drawing a circle inside a polygon such that the circle is tangent to each side of the polygon. It is commonly used in relation to triangles, where the circle is inscribed within the triangle and tangent to all its sides.\",\n    \"Formal Language\": \"InscribedCircle \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Right Triangle\",\n    \"Definition\": \"A triangle in which one of the angles is a right angle (90 degrees).\",\n    \"Formal Language\": \"A \\triangle ABC \\text{ is a Right Triangle if } \\angle C = 90^\\circ\"\n}\n```",
    "```json\n{\n    \"Name\": \"Hinge Theorem\",\n    \"Definition\": \"The Hinge Theorem states that if two sides of a triangle are congruent to two sides of another triangle, but the included angle of the first triangle is larger than the included angle of the second, then the third side of the first triangle is longer than the third side of the second triangle.\",\n    \"Formal Language\": \"If two triangles have two pairs of congruent sides but differing included angles, the longer side is opposite the larger angle.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Abscissa\",\n    \"Definition\": \"The abscissa is the x-coordinate of a point in the Cartesian coordinate system.\",\n    \"Formal Language\": \"Abscissa \\in \\mathbb{R}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Quadrant\",\n    \"Definition\": \"One of the four sections of a Cartesian coordinate plane, each bounded by two axes.\",\n    \"Formal Language\": \"Quadrant \\in Cartesian\\_Plane\"\n}\n```",
    "```json\n{\n    \"Name\": \"Analytic Geometry\",\n    \"Definition\": \"A branch of mathematics that uses algebraic equations to describe and analyze geometric properties, figures, and their relationships on the coordinate plane.\",\n    \"Formal Language\": \"Analytic Geometry \\in Mathematics \\setminus (Algebra \\cup Geometry)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Axis\",\n    \"Definition\": \"A reference line used in a graph or coordinate system that helps to measure positions. The most common axes are the x-axis (horizontal) and y-axis (vertical) in a Cartesian coordinate system.\",\n    \"Formal Language\": \"Axis \\in Graph \\cup Coordinate \\, System\"\n}\n```",
    "```json\n{\n    \"Name\": \"Right-Handed Coordinate System\",\n    \"Definition\": \"A coordinate system where the thumb, index, and middle fingers of the right hand can be oriented perpendicular to each other to represent the x, y, and z axes respectively. It is commonly used in physics and mathematics to visualize 3D space.\",\n    \"Formal Language\": \"Right-Handed Coordinate System \\in 3D Coordinate Systems\"\n}\n```",
    "```json\n{\n    \"Name\": \"Azimuth\",\n    \"Definition\": \"Azimuth is the angle between the projected vector of an object and a reference direction, typically measured clockwise from the north in navigation.\",\n    \"Formal Language\": \"Azimuth \\in [0, 360) degrees measured from North\"\n}\n```",
    "{\n    \"Name\": \"Cartesian Coordinates\",\n    \"Definition\": \"A system that specifies each point uniquely in a plane by a pair of numerical coordinates, which are the distances to the point from two fixed perpendicular oriented lines measured in the same unit of length.\",\n    \"Formal Language\": \"Cartesian Coordinates \\in \\mathbb{R}^2\"\n}",
    "```json\n{\n    \"Name\": \"Octant\",\n    \"Definition\": \"One of the eight divisions of a three-dimensional coordinate system, created by the x, y, and z axes. Similar to quadrants in two dimensions but extends the concept into three dimensions.\",\n    \"Formal Language\": \"Octant \\in \\mathbb{R}^3\"\n}\n```",
    "```json\n{\n    \"Name\": \"Origin\",\n    \"Definition\": \"The point where the axes of a coordinate system intersect, typically (0,0) in two dimensions or (0,0,0) in three dimensions.\",\n    \"Formal Language\": \"Origin = (0,0) \\in \\mathbb{R}^2 \\text{ or } (0,0,0) \\in \\mathbb{R}^3\"\n}\n```",
    "```json\n{\n    \"Name\": \"Cartesian Geometry\",\n    \"Definition\": \"A branch of geometry that uses a coordinate system to describe the positions and relationships of points, lines, and shapes in space.\",\n    \"Formal Language\": \"Cartesian Geometry \\in \\mathbb{R}^n\"\n}\n```",
    "```json\n{\n    \"Name\": \"Cartesian Plane\",\n    \"Definition\": \"A plane consisting of a horizontal number line, the x-axis, and a vertical number line, the y-axis, which intersect at a point known as the origin.\",\n    \"Formal Language\": \"Cartesian Plane \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"x-Axis\",\n    \"Definition\": \"The horizontal axis in a coordinate plane, used to measure or locate a point by its horizontal distance from the origin.\",\n    \"Formal Language\": \"x-Axis \\in Cartesian Coordinate System\"\n}\n```",
    "```json\n{\n    \"Name\": \"Coordinate System\",\n    \"Definition\": \"A framework to uniquely determine the position of a point or a geometric element within a given space using ordered sets of numbers, often in two-dimensional or three-dimensional spaces.\",\n    \"Formal Language\": \"Coordinate System \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Coordinates\",\n    \"Definition\": \"A set of values that show an exact position, usually represented as pairs (x, y) for a point in a two-dimensional space.\",\n    \"Formal Language\": \"Coordinates \\in \\mathbb{R}^n \\text{ where } n=2 \\text{ for 2D space}\"\n}",
    "```json\n{\n    \"Name\": \"y-Axis\",\n    \"Definition\": \"The vertical axis in a two-dimensional coordinate system, used to measure or plot values.\",\n    \"Formal Language\": \"y-Axis \\in Coordinate System\"\n}\n```",
    "```json\n{\n    \"Name\": \"z-Axis\",\n    \"Definition\": \"The z-axis is the third axis in a three-dimensional coordinate system, typically representing depth.\",\n    \"Formal Language\": \"z-Axis \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Zenith Angle\",\n    \"Definition\": \"The angle between a point directly overhead (the zenith) and a particular point on the sky or celestial sphere, usually measured in degrees from 0 to 90.\",\n    \"Formal Language\": \"Zenith Angle \\in [0^\\circ, 90^\\circ]\"\n}",
    "```json\n{\n    \"Name\": \"Cylindrical Equidistant Projection\",\n    \"Definition\": \"A type of map projection where meridians and parallels are equally spaced straight lines, which represents the earth in a cylindrical shape.\",\n    \"Formal Language\": \"CylindricalEquidistantProjection \\in MapProjectionTypes\"\n}\n```",
    "```json\n{\n    \"Name\": \"Orthogonal Projection\",\n    \"Definition\": \"An orthogonal projection is a linear transformation from a vector space onto a subspace such that the transformation is idempotent and any vector in the original space can be decomposed into two orthogonal components: one in the subspace and one in its orthogonal complement.\",\n    \"Formal Language\": \"Orthogonal Projection: \\n P: V \\to U, \\, P^2 = P \\, \\text{where}\\, U \\subseteq V \\, \\text{and}\\, \\forall v \\in V, \\, v = u + w, \\, u \\in U, \\, w \\in U^\\perp\"\n}\n```",
    "```json\n{\n    \"Name\": \"Equal-Area Projection\",\n    \"Definition\": \"A map projection that preserves area, meaning that the areas on the map are proportional to the areas on Earth.\",\n    \"Formal Language\": \"EqualAreaProjection \\in MapProjection\"\n}\n```",
    "```json\n{\n    \"Name\": \"Orthographic Projection\",\n    \"Definition\": \"A method of representing three-dimensional objects in two dimensions, using multiple views of the object, usually front, top, and side.\",\n    \"Formal Language\": \"Orthographic Projection \\in Graphic Visualization\"\n}\n```",
    "```json\n{\n    \"Name\": \"Conic Projection\",\n    \"Definition\": \"A map projection in which the surface features of a globe are projected onto a cone, which is then unrolled into a flat surface.\",\n    \"Formal Language\": \"Conic Projection \\in Mapping \\text{ or } Cartography\"\n}\n```",
    "```json\n{\n    \"Name\": \"Projection\",\n    \"Definition\": \"In mathematics, a projection is an operation that transforms a point, vector, or set onto a subspace or subset according to a specific rule, usually in a manner that results in a loss of some aspect or dimension.\",\n    \"Formal Language\": \"Projection \\in LinearMapping\"\n}\n```",
    "```json\n{\n    \"Name\": \"Shadow\",\n    \"Definition\": \"A shadow is a dark area or shape produced by an object coming between rays of light and a surface.\",\n    \"Formal Language\": \"Shadow \\in Physics\"\n}\n```",
    "```json\n{\n    \"Name\": \"Perspective\",\n    \"Definition\": \"In geometry, perspective refers to the technique used to represent three-dimensional objects on a two-dimensional surface, giving the impression of depth and space.\",\n    \"Formal Language\": \"Perspective \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Vanishing Point\",\n    \"Definition\": \"A point in perspective drawing where parallel lines appear to converge, giving the illusion of depth and distance.\",\n    \"Formal Language\": \"Vanishing Point \\in PerspectiveDrawing\"\n}\n```",
    "```json\n{\n    \"Name\": \"Euclidean Tools\",\n    \"Definition\": \"Instruments used in the construction and exploration of geometric figures, adhering to the principles of Euclidean geometry, typically including a compass and straightedge.\",\n    \"Formal Language\": \"Euclidean Tools \\subseteq {Compass, Straightedge, Ruler, Protractor}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Geometric Construction\",\n    \"Definition\": \"A method of creating geometric figures using only a compass and a straightedge.\",\n    \"Formal Language\": \"Geometric Construction \\in Geometry\"\n}\n```",
    "{\"Name\": \"Polygon Intersection\", \"Definition\": \"The process or operation of determining the set of points that two or more polygons have in common.\", \"Formal Language\": \"PolygonIntersection ∈ ComputationalGeometry\"}",
    "```json\n{\n    \"Name\": \"Polygon Tessellation\",\n    \"Definition\": \"A pattern made of polygons that completely covers a plane without any gaps or overlaps.\",\n    \"Formal Language\": \"Polygon Tessellation \\in Plane \\rightarrow \\text{No Gaps or Overlaps}\"\n}\n```",
    "{\n    \"Name\": \"Triangulation\",\n    \"Definition\": \"Triangulation is the process of determining the location of a point by forming triangles to it from known points; commonly used in surveying and navigation.\",\n    \"Formal Language\": \"Triangulation \\in Geometry\"\n}",
    "{\n    \"Name\": \"Random Polygon\",\n    \"Definition\": \"A polygon with a set number of vertices where the positions of the vertices are determined randomly.\",\n    \"Formal Language\": \"Random Polygon \\in Geometry\"\n}",
    "```json\n{\n    \"Name\": \"Mean Triangle Area\",\n    \"Definition\": \"The average area of a set of triangles, which can be found by summing the areas of each triangle and dividing by the number of triangles.\",\n    \"Formal Language\": \"Mean(TriangleArea) = (1/n) * Σ(TriangleArea_i), i = 1 to n\"\n}\n```",
    "```json\n{\n    \"Name\": \"Triangle Circumscribing\",\n    \"Definition\": \"A circle that passes through all the vertices of a triangle, also known as the circumcircle of the triangle.\",\n    \"Formal Language\": \"Circumcircle \\triangle_a, \\triangle_b, \\triangle_c\"\n}\n```",
    "```json\n{\n    \"Name\": \"Tiling Problem\",\n    \"Definition\": \"The tiling problem involves covering a plane, or a region within a plane, with a set of given shapes without overlaps and gaps, often explored to understand geometric principles.\",\n    \"Formal Language\": \"TilingProblem \\in Combinatorics\"\n}\n```",
    "```json\n{\n    \"Name\": \"Geometric Modeling\",\n    \"Definition\": \"The process of creating a mathematical representation of the surfaces of objects through the use of geometry.\",\n    \"Formal Language\": \"Geometric Modeling \\in Geometry \\land Computer Graphics\"\n}\n```",
    "```json\n{\n    \"Name\": \"Overlapping Rectangles\",\n    \"Definition\": \"A concept in geometry where two rectangles share a common area within a plane.\",\n    \"Formal Language\": \"Two rectangles overlap if their bounding boxes intersect such that both the x and y coordinates overlap.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Triangle Interior\",\n    \"Definition\": \"The triangle interior refers to the area of the triangle that lies inside its three sides or boundaries.\",\n    \"Formal Language\": \"Interior(ABC) = { P | P is inside triangle ABC }\"\n}\n```",
    "```json\n{\n    \"Name\": \"Point Distances\",\n    \"Definition\": \"The calculation of the shortest distance between two points in a given space, typically using the distance formula derived from the Pythagorean Theorem.\",\n    \"Formal Language\": \"Distance = \\\\sqrt{(x_2 - x_1)^2 + (y_2 - y_1)^2} \\in \\mathbb{R}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Lattice Point\",\n    \"Definition\": \"A point in the coordinate plane where both the x and y coordinates are integers.\",\n    \"Formal Language\": \"Lattice Point \\in \\mathbb{Z} \\times \\mathbb{Z}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Planar Distance\",\n    \"Definition\": \"The distance between two points in a two-dimensional plane, typically calculated using the Euclidean distance formula.\",\n    \"Formal Language\": \"d((x_1, y_1), (x_2, y_2)) = \\\\sqrt{(x_2 - x_1)^2 + (y_2 - y_1)^2} in Mathematics\"\n}\n```",
    "```json\n{\n    \"Name\": \"Center\",\n    \"Definition\": \"In geometry, the center is the midpoint of a circle or sphere, equidistant from all points on the boundary.\",\n    \"Formal Language\": \"Center \\in Point\"\n}\n```",
    "```json\n{\n    \"Name\": \"Concentric\",\n    \"Definition\": \"Circles or other shapes that share the same center but have different radii.\",\n    \"Formal Language\": \"Concentric \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Euclidean Geometry\",\n    \"Definition\": \"A mathematical system attributed to the ancient Greek mathematician Euclid, which studies the properties and relations of points, lines, and planes in a two-dimensional and three-dimensional space.\",\n    \"Formal Language\": \"EuclideanGeometry \\subseteq Geometry\"\n}",
    "```json\n{\n    \"Name\": \"Geometric Centroid\",\n    \"Definition\": \"The geometric centroid, or barycenter, is the arithmetic mean position of all the points in a shape or object. It can be thought of as the center of mass of the shape, assuming a uniform density.\",\n    \"Formal Language\": \"Centroid \\vec{C} = \\frac{1}{A} \\int \\int \\vec{r}(x,y) \\, dA\"\n}\n```",
    "```json\n{\n    \"Name\": \"Geometry\",\n    \"Definition\": \"A branch of mathematics concerned with the properties and relations of points, lines, surfaces, and solids.\",\n    \"Formal Language\": \"Geometry \\in Mathematics\"\n}\n```",
    "```json\n{\n    \"Name\": \"Mensuration Formula\",\n    \"Definition\": \"A mensuration formula is a mathematical equation used to calculate dimensions, area, volume, and other geometric properties of shapes and figures.\",\n    \"Formal Language\": \"Mensuration Formula \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Pick's Theorem\",\n    \"Definition\": \"A mathematical formula used to determine the area of a simple lattice polygon, a polygon whose vertices are points on a grid of equally spaced points.\",\n    \"Formal Language\": \"Area = I + B/2 - 1, where I is the number of lattice points inside the polygon and B is the number of lattice points on the boundary.\"\n}\n```",
    "{\n    \"Name\": \"Home Plate\",\n    \"Definition\": \"Home plate is one of the four bases baseball players must touch to score a run. It is a five-sided slab of rubber that serves as the starting and ending point for each play.\",\n    \"Formal Language\": \"Home Plate \\in Sports Equipment\"\n}",
    "{\n    \"Name\": \"Polygon Tiling\",\n    \"Definition\": \"Polygon tiling refers to covering a plane without gaps or overlaps using one or more geometric shapes called polygons.\",\n    \"Formal Language\": \"Polygon Tiling \\in Planar Geometry\"\n}",
    "{\n    \"Name\": \"Icosagon\",\n    \"Definition\": \"A polygon with 20 sides and 20 angles.\",\n    \"Formal Language\": \"Icosagon \\in Polygon, n = 20\"\n}",
    "```json\n{\n    \"Name\": \"Polygon Vertex\",\n    \"Definition\": \"A point where two sides of a polygon meet.\",\n    \"Formal Language\": \"Vertex \\in Point \\cap Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Icosidodecagon\",\n    \"Definition\": \"A twenty-sided polygon with alternating side lengths, commonly recognized as a semi-regular polytope formed by 12 equilateral triangles and 20 equilateral pentagons converging in three around a vertex.\",\n    \"Formal Language\": \"Icosidodecagon \\in Polygon\"\n}\n```",
    "{\n    \"Name\": \"Icositetragon\",\n    \"Definition\": \"A polygon with 24 sides.\",\n    \"Formal Language\": \"Icositetragon \\in Polygon\"\n}",
    "```json\n{\n    \"Name\": \"Regular Decagon\",\n    \"Definition\": \"A ten-sided polygon with all sides and angles equal.\",\n    \"Formal Language\": \"Regular Decagon \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Regular Dodecagon\",\n    \"Definition\": \"A regular dodecagon is a twelve-sided polygon where all sides and angles are equal.\",\n    \"Formal Language\": \"Regular Dodecagon \\subseteq Polygon \\wedge \\forall i, j \\in \\{1, ..., 12\\}, side_i = side_j \\wedge angle_i = angle_j\"\n}\n```",
    "```json\n{\n    \"Name\": \"Regular Heptagon\",\n    \"Definition\": \"A polygon with seven equal sides and seven equal angles.\",\n    \"Formal Language\": \"Regular Heptagon \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Centroid Hexagon\",\n    \"Definition\": \"A centroid of a hexagon is the point where all the diagonals of the hexagon intersect. It can be thought of as the 'center of mass' of the hexagon.\",\n    \"Formal Language\": \"Centroid \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Regular Hexagon\",\n    \"Definition\": \"A polygon with six sides that are all congruent and angles that are all equal.\",\n    \"Formal Language\": \"Regular Hexagon \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Concave Polygon\",\n    \"Definition\": \"A polygon that has at least one interior angle greater than 180 degrees and at least one vertex that points inward.\",\n    \"Formal Language\": \"Concave Polygon \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Regular Nonagon\",\n    \"Definition\": \"A regular nonagon is a nine-sided polygon where all sides and angles are equal.\",\n    \"Formal Language\": \"Regular Nonagon \\in Polygon, Sides = 9\"\n}\n```",
    "```json\n{\n    \"Name\": \"Regular Octagon\",\n    \"Definition\": \"A polygon with eight sides of equal length and eight equal angles.\",\n    \"Formal Language\": \"Regular Octagon \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Convex Polygon\",\n    \"Definition\": \"A polygon is convex if any line segment connecting two points inside the polygon lies entirely inside the polygon.\",\n    \"Formal Language\": \"ConvexPolygon \\subseteq Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Myriagon\",\n    \"Definition\": \"A polygon with 10,000 sides.\",\n    \"Formal Language\": \"Myriagon \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Regular Pentagon\",\n    \"Definition\": \"A polygon with five equal sides and five equal angles, each interior angle being 108 degrees.\",\n    \"Formal Language\": \"Regular Pentagon \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Nested Polygon\",\n    \"Definition\": \"A configuration in which one polygon is located entirely within another polygon.\",\n    \"Formal Language\": \"Nested Polygon \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Regular Polygon\",\n    \"Definition\": \"A polygon that is both equiangular (all angles are equal) and equilateral (all sides have the same length).\",\n    \"Formal Language\": \"Regular Polygon \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Nonagon\",\n    \"Definition\": \"A polygon with nine sides and nine angles.\",\n    \"Formal Language\": \"Nonagon \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Octadecagon\",\n    \"Definition\": \"A polygon with eighteen sides and eighteen angles.\",\n    \"Formal Language\": \"Octadecagon \\in Polygon\"\n}",
    "```json\n{\n    \"Name\": \"Decagon\",\n    \"Definition\": \"A polygon with ten sides and ten angles.\",\n    \"Formal Language\": \"Decagon \\in Polygon \\text{ with } n=10\"\n}\n```",
    "```json\n{\n    \"Name\": \"Octagon\",\n    \"Definition\": \"A polygon with eight sides and eight angles.\",\n    \"Formal Language\": \"Octagon \\in Polygon \\land \\text{Number of sides} = 8\"\n}\n```",
    "```json\n{\n    \"Name\": \"Octagram\",\n    \"Definition\": \"An octagram is an eight-pointed star polygon.\",\n    \"Formal Language\": \"Octagram \\in Polygon \\cap Star\"\n}\n```",
    "```json\n{\n    \"Name\": \"Simple Polygon\",\n    \"Definition\": \"A simple polygon is a flat shape consisting of straight, non-intersecting lines that are joined to form a closed figure.\",\n    \"Formal Language\": \"SimplePolygon \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Dodecagon\",\n    \"Definition\": \"A polygon with twelve sides and twelve angles.\",\n    \"Formal Language\": \"Dodecagon \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Star\",\n    \"Definition\": \"In mathematical context, a 'star' often refers to a specific notation or operator, such as the asterisk (*) used for multiplication of numbers or the operation representing convolution of functions in more advanced mathematics.\",\n    \"Formal Language\": \"Star \\in Operator\"\n}\n```\n(Note: The term \"Star\" is broad and sometimes requires context to provide a precise definition in math. It isn't a standard mathematical concept directly taught in the K-12 curriculum without specific context.)",
    "```json\n{\n    \"Name\": \"Pentadecagon\",\n    \"Definition\": \"A polygon with fifteen sides and fifteen angles.\",\n    \"Formal Language\": \"Pentadecagon \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Star Figure\",\n    \"Definition\": \"A geometric shape that resembles a star, typically characterized by a set of points or vertices radiating from a central point in symmetrical fashion.\",\n    \"Formal Language\": \"Star Figure \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Enneacontagon\",\n    \"Definition\": \"A polygon with 90 sides.\",\n    \"Formal Language\": \"Enneacontagon \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Pentagon\",\n    \"Definition\": \"A polygon with five sides and five angles.\",\n    \"Formal Language\": \"Pentagon \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Pentagram\",\n    \"Definition\": \"A pentagram is a five-pointed star formed by drawing a continuous line in five straight segments and is often associated with geometric shapes and symbolism.\",\n    \"Formal Language\": \"Pentagram \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Equiangular Polygon\",\n    \"Definition\": \"A polygon in which all interior angles are equal.\",\n    \"Formal Language\": \"Equiangular Polygon \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Equilateral Polygon\",\n    \"Definition\": \"A polygon in which all sides have the same length.\",\n    \"Formal Language\": \"EquilateralPolygon \\subseteq Polygon \\land \\forall i,j (Side_i = Side_j)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Star Polygon\",\n    \"Definition\": \"A star polygon is a type of non-convex polygon which resembles a star. They are typically defined by connecting every k-th point out of n equally spaced points on a circumference.\",\n    \"Formal Language\": \"Star Polygon \\subseteq Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Planar Polygon\",\n    \"Definition\": \"A flat, two-dimensional shape with straight sides that are fully closed. All the points of a planar polygon lie on a single plane.\",\n    \"Formal Language\": \"Planar Polygon \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polygon\",\n    \"Definition\": \"A closed plane figure bounded by straight lines.\",\n    \"Formal Language\": \"Polygon \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Tetradecagon\",\n    \"Definition\": \"A polygon with fourteen sides and fourteen angles.\",\n    \"Formal Language\": \"Tetradecagon \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Hendecagon\",\n    \"Definition\": \"A polygon with eleven sides and eleven angles.\",\n    \"Formal Language\": \"Hendecagon \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polygon Area\",\n    \"Definition\": \"The total space enclosed by the boundary of a polygon, calculated using specific formulas depending on the type of polygon.\",\n    \"Formal Language\": \"Polygon Area \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Triacontagon\",\n    \"Definition\": \"A polygon with 30 sides and 30 angles.\",\n    \"Formal Language\": \"Triacontagon \\in Polygon\"\n}",
    "```json\n{\n    \"Name\": \"Tridecagon\",\n    \"Definition\": \"A polygon with 13 sides and 13 angles.\",\n    \"Formal Language\": \"Tridecagon \\in Polygon \\subset \\mathbb{R}^2\"\n}\n```",
    "```json\n{\n    \"Name\": \"Heptagon\",\n    \"Definition\": \"A polygon with seven sides and seven angles.\",\n    \"Formal Language\": \"Heptagon \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polygon Diagonal\",\n    \"Definition\": \"A line segment connecting two non-adjacent vertices of a polygon.\",\n    \"Formal Language\": \"Diagonal \\in PolygonGeometry\"\n}\n```",
    "{\n    \"Name\": \"Polygon Diameter\",\n    \"Definition\": \"The longest distance between any two points on the boundary of a polygon.\",\n    \"Formal Language\": \"Polygon Diameter \\in \\mathbb{R}\"\n}",
    "```json\n{\n    \"Name\": \"Hexadecagon\",\n    \"Definition\": \"A polygon with sixteen sides and sixteen angles.\",\n    \"Formal Language\": \"Hexadecagon \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polygon Edge\",\n    \"Definition\": \"A line segment that joins two vertices in a polygon.\",\n    \"Formal Language\": \"Edge \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Hexagon\",\n    \"Definition\": \"A polygon with six sides and six angles.\",\n    \"Formal Language\": \"Hexagon \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Hexagram\",\n    \"Definition\": \"A star-shaped figure formed by extending the sides of a regular hexagon or composed of two overlapping equilateral triangles.\",\n    \"Formal Language\": \"Hexagram \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Coincident\",\n    \"Definition\": \"Something happening at the same place or time, or two geometrical elements occupying the same position, such as overlapping lines or points.\",\n    \"Formal Language\": \"Coincident \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Ratio of Magnification\",\n    \"Definition\": \"The ratio of the size of the image to the size of the object, used to determine how much larger or smaller the image is compared to the object itself.\",\n    \"Formal Language\": \"Ratio of Magnification = (Image Size) / (Object Size)\"\n}",
    "{\n    \"Name\": \"Scaling\",\n    \"Definition\": \"Scaling in mathematics typically refers to enlarging or reducing the size of an object while maintaining its shape. In data management or algebra, it can refer to multiplying quantities by a constant factor.\",\n    \"Formal Language\": \"Scaling \\in Transformation\"\n}",
    "```json\n{\n    \"Name\": \"Self-Similarity\",\n    \"Definition\": \"An object is self-similar if it looks the same at any magnification level; common in fractals.\",\n    \"Formal Language\": \"Self-Similarity \\in Fractal Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Similar\",\n    \"Definition\": \"Shapes that have the same form and angle measures but are different in size. In mathematics, similar figures have proportional corresponding side lengths.\",\n    \"Formal Language\": \"Similar \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Similarity\",\n    \"Definition\": \"Similarity in geometry refers to a relationship between two shapes of such that they have the same shape but may differ in size.\",\n    \"Formal Language\": \"Similarity \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Similitude Ratio\",\n    \"Definition\": \"The ratio of the lengths of corresponding sides in similar figures or geometric shapes.\",\n    \"Formal Language\": \"Similitude Ratio \\in \\mathbb{R}^{+}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Geometric Congruence\",\n    \"Definition\": \"Geometric congruence refers to the relationship between two figures or shapes that have the same size and shape, meaning their corresponding angles and sides are equal.\",\n    \"Formal Language\": \"If \\u2206ABC \\u2243 \\u2206DEF, then AB = DE, BC = EF, CA = FD and corresponding angles are equal.\"\n}\n```",
    "```json\n{\n    \"Name\": \"3, 4, 5 Triangle\",\n    \"Definition\": \"A right triangle where the sides are in the ratio 3:4:5, which satisfies the Pythagorean theorem a^2 + b^2 = c^2.\",\n    \"Formal Language\": \"For integer multiples of 3 and 4, they form a Pythagorean triple with 5 (3^2 + 4^2 = 5^2)\"\n}\n```",
    "```json\n{\n    \"Name\": \"AAA Theorem\",\n    \"Definition\": \"A theorem in geometry that states that if two triangles have their corresponding angles equal, then the triangles are similar.\",\n    \"Formal Language\": \"AAA Theorem \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"AAS Theorem\",\n    \"Definition\": \"The Angle-Angle-Side (AAS) theorem states that if two angles and the non-included side of one triangle are congruent to two angles and the non-included side of another triangle, then the triangles are congruent.\",\n    \"Formal Language\": \"If ∠A ≅ ∠D, ∠B ≅ ∠E, and BC ≅ EF, then ΔABC ≅ ΔDEF.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Heron's Formula\",\n    \"Definition\": \"A formula that allows the calculation of the area of a triangle when the lengths of all three sides are known.\",\n    \"Formal Language\": \"Area = √[s(s-a)(s-b)(s-c)], where s is the semiperimeter, s = (a+b+c)/2 and a, b, c are the side lengths of the triangle\"\n}\n```",
    "```json\n{\n    \"Name\": \"SAS Theorem\",\n    \"Definition\": \"The Side-Angle-Side (SAS) Theorem states that if two sides and the included angle of one triangle are congruent to two sides and the included angle of another triangle, then the two triangles are congruent.\",\n    \"Formal Language\": \"If ΔABC and ΔDEF have AB = DE, ∠B = ∠E, and BC = EF, then ΔABC ≅ ΔDEF\"\n}\n```",
    "```json\n{\n    \"Name\": \"Hypotenuse\",\n    \"Definition\": \"The longest side of a right-angled triangle, opposite the right angle.\",\n    \"Formal Language\": \"Hypotenuse \\in \\triangle (right-angled)\"\n}\n```",
    "```json\n{\n    \"Name\": \"SSS Theorem\",\n    \"Definition\": \"A geometric theorem stating that if three sides of one triangle are equal to three sides of another triangle, then the two triangles are congruent.\",\n    \"Formal Language\": \"SSS \\equiv \\triangle ABC \\cong \\triangle DEF \\; \\text{if} \\; AB = DE, BC = EF, AC = DF\"\n}\n```",
    "```json\n{\n    \"Name\": \"Area Principle\",\n    \"Definition\": \"A principle stating that in a statistical graphic, the area occupied by a part of the graph should be proportional to the magnitude of the value it represents.\",\n    \"Formal Language\": \"Area Principle \\in Data Visualization\"\n}\n```",
    "{\n    \"Name\": \"ASA Theorem\",\n    \"Definition\": \"The Angle-Side-Angle (ASA) Theorem states that two triangles are congruent if two angles and the included side of one triangle are equal to two angles and the included side of the other triangle.\",\n    \"Formal Language\": \"ASA \\triangle ABC \\cong \\triangle DEF \\text{ if } \\angle A = \\angle D, \\angle B = \\angle E, \\text{ and } AB = DE\"\n}",
    "```json\n{\n    \"Name\": \"Leg\",\n    \"Definition\": \"In a right triangle, a leg is either of the two sides that form the right angle.\",\n    \"Formal Language\": \"Leg \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Triangle Area\",\n    \"Definition\": \"The amount of space enclosed by a triangle, typically calculated using the formula: area = 1/2 * base * height.\",\n    \"Formal Language\": \"Area_{triangle} = \\\\frac{1}{2} \\times base \\times height\"\n}\n```",
    "{\n    \"Name\": \"Triangle Counting\",\n    \"Definition\": \"Triangle counting is the process of counting the number of triangles that exist in a graph. It is a common problem in graph theory and network analysis.\",\n    \"Formal Language\": \"Triangle Counting \\in Graph Theory \\cup Network Analysis\"\n}",
    "```json\n{\n    \"Name\": \"Triangle Geometry\",\n    \"Definition\": \"A branch of geometry that deals with the properties and relationships of triangles, including their angles, sides, and the principles that govern their principles like congruence and similarity.\",\n    \"Formal Language\": \"TriangleGeometry \\subseteq Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Triangle Median\",\n    \"Definition\": \"A line segment joining a vertex of a triangle to the midpoint of the opposite side.\",\n    \"Formal Language\": \"In a triangle ABC, if D is the midpoint of side BC, then AD is a median. Median \\in LineSegment\"\n}\n```",
    "```json\n{\n    \"Name\": \"Pythagorean Theorem\",\n    \"Definition\": \"A fundamental relation in Euclidean geometry among the three sides of a right triangle, stating that the square of the hypotenuse is equal to the sum of the squares of the other two sides.\",\n    \"Formal Language\": \"For a right triangle with sides a, b, and c (where c is the hypotenuse), a^2 + b^2 = c^2\"\n}\n```",
    "```json\n{\n    \"Name\": \"Euler Line\",\n    \"Definition\": \"In a triangle, the Euler Line is a straight line that passes through several important points such as the orthocenter, centroid, and circumcenter.\",\n    \"Formal Language\": \"EulerLine \\subseteq \\mathbb{R}^2, \\, \\text{passing through } (H, G, O)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Incircle\",\n    \"Definition\": \"The incircle of a triangle or polygon is the largest circle contained within it, tangent to each side.\",\n    \"Formal Language\": \"Incircle \\subseteq Circle\"\n}\n```",
    "```json\n{\n    \"Name\": \"Circumcircle\",\n    \"Definition\": \"A circumcircle is the unique circle that passes through all vertices of a polygon, often a triangle.\",\n    \"Formal Language\": \"Circumcircle \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Inradius\",\n    \"Definition\": \"The radius of the largest circle that can be inscribed within a polygon, commonly a triangle.\",\n    \"Formal Language\": \"Inradius = \\dfrac{Area}{Semi-perimeter} \\text{ for triangles}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Circle Function\",\n    \"Definition\": \"A function that describes a set of points equidistant from a center point in a plane, often represented by the equation x^2 + y^2 = r^2 for a circle centered at the origin with radius r.\",\n    \"Formal Language\": \"Circle Function \\in Function\"\n}\n```",
    "```json\n{\n    \"Name\": \"Circumradius\",\n    \"Definition\": \"The circumradius is the radius of the circumcircle, which is the circle that passes through all the vertices of a polygon, typically a triangle.\",\n    \"Formal Language\": \"Circumradius \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Excircles\",\n    \"Definition\": \"Excircles are circles that are tangent to one side of a triangle and the extensions of the other two sides. Each triangle has three excircles, each associated with one of its sides.\",\n    \"Formal Language\": \"Excircles \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Tangential Circle\",\n    \"Definition\": \"A circle that is tangent to another geometric figure, meaning it touches the figure at exactly one point.\",\n    \"Formal Language\": \"Tangential Circle \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Incenter\",\n    \"Definition\": \"The point where the angle bisectors of a triangle intersect, which is equidistant from all sides of the triangle.\",\n    \"Formal Language\": \"Incenter \\in Point\"\n}\n```",
    "```json\n{\n    \"Name\": \"Regular Triangle Center\",\n    \"Definition\": \"A 'regular triangle' typically refers to an equilateral triangle, and its center can refer to the centroid, which is the point of intersection of its medians. It is also the center of its circumscribed and inscribed circles.\",\n    \"Formal Language\": \"Regular Triangle Center = Centroid \\cap Circumcenter \\cap Incenter\"\n}\n```",
    "{\n    \"Name\": \"Circumcenter\",\n    \"Definition\": \"The circumcenter is the point where the perpendicular bisectors of the sides of a triangle intersect, and it is equidistant from all three vertices of the triangle.\",\n    \"Formal Language\": \"Circumcenter \\in Geometry\"\n}",
    "```json\n{\n    \"Name\": \"Excenter\",\n    \"Definition\": \"An excenter is the center of an excircle of a triangle, which is a circle tangent to one side of the triangle and the extensions of the other two sides.\",\n    \"Formal Language\": \"Excenter \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Triangle Center\",\n    \"Definition\": \"A point in a triangle that can be considered a 'center'; examples include the centroid, orthocenter, circumcenter, and incenter.\",\n    \"Formal Language\": \"Triangle Center \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Triangle Centroid\",\n    \"Definition\": \"The point where the three medians of a triangle intersect, often considered the center of mass or balance point.\",\n    \"Formal Language\": \"Centroid = (Intersection point of all medians of a triangle) \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Triangulation Point\",\n    \"Definition\": \"A fixed point on the earth's surface used in triangulation surveys to measure distances and angles, allowing cartographers and geographers to accurately map the terrain.\",\n    \"Formal Language\": \"Triangulation Point \\in Surveying\"\n}\n```",
    "```json\n{\n    \"Name\": \"Orthocenter\",\n    \"Definition\": \"The point where all the altitudes of a triangle intersect.\",\n    \"Formal Language\": \"Orthocenter \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Oblique Triangle\",\n    \"Definition\": \"An oblique triangle is a triangle that does not have a right angle. It can either be an acute triangle, with all angles less than 90 degrees, or an obtuse triangle, with one angle greater than 90 degrees.\",\n    \"Formal Language\": \"ObliqueTriangle \\in Triangle \\land \\neg (RightAngle)\"\n}\n```",
    "```json\n{\n    \"Name\": \"30-60-90 Triangle\",\n    \"Definition\": \"A special type of right triangle where the angles are 30 degrees, 60 degrees, and 90 degrees, and the sides are in a specific simple ratio involving the square root of 3.\",\n    \"Formal Language\": \"30-60-90 Triangle \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Acute Triangle\",\n    \"Definition\": \"A triangle where all three interior angles are less than 90 degrees.\",\n    \"Formal Language\": \"AcuteTriangle \\forall \\theta_i < 90^\\circ, \\theta_i \\in \\{ \\text{angles of the triangle} \\}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Primitive Right Triangle\",\n    \"Definition\": \"A primitive right triangle is a right triangle whose side lengths are coprime, that is, the greatest common divisor (GCD) of the side lengths is 1.\",\n    \"Formal Language\": \"Primitive Right Triangle: For sides a, b, c, where c is the hypotenuse, gcd(a, b, c) = 1 and a^2 + b^2 = c^2.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Isosceles Right Triangle\",\n    \"Definition\": \"A triangle with two equal sides and one right angle (90 degrees).\",\n    \"Formal Language\": \"Triangle(A = B, C = 90^\\circ)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Scalene Triangle\",\n    \"Definition\": \"A triangle in which all three sides have different lengths.\",\n    \"Formal Language\": \"Scalene \\triangle is a \\triangle with sides a ≠ b ≠ c.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Isosceles Triangle\",\n    \"Definition\": \"A triangle that has at least two sides of equal length.\",\n    \"Formal Language\": \"Isosceles Triangle \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Equilateral Triangle\",\n    \"Definition\": \"A triangle in which all three sides are of equal length and all three internal angles are equal to 60 degrees.\",\n    \"Formal Language\": \"Equilateral Triangle \\in Geometry, \\forall sides(a, b, c), a = b = c\"\n}\n```",
    "```json\n{\n    \"Name\": \"Similar Triangles\",\n    \"Definition\": \"Triangles that have the same shape but may differ in size. This means their corresponding angles are equal and their corresponding sides are in proportion.\",\n    \"Formal Language\": \"Similar \\triangle ABC \\sim \\triangle DEF \\iff \\angle A = \\angle D, \\angle B = \\angle E, \\angle C = \\angle F \\text{ and } \\frac{AB}{DE} = \\frac{BC}{EF} = \\frac{CA}{FD}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Triangle\",\n    \"Definition\": \"A polygon with three edges and three vertices.\",\n    \"Formal Language\": \"Triangle \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Inscribed Triangle\",\n    \"Definition\": \"An inscribed triangle is a triangle placed inside a circle such that all the vertices of the triangle lie on the circle.\",\n    \"Formal Language\": \"InscribedTriangle \\subset Circle\"\n}\n```",
    "```json\n{\n    \"Name\": \"Medial Triangle\",\n    \"Definition\": \"A triangle formed by connecting the midpoints of the sides of a given triangle. Each side of the medial triangle is parallel to one of the sides of the original triangle and half the length.\",\n    \"Formal Language\": \"Medial Triangle \\subseteq Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Orthic Triangle\",\n    \"Definition\": \"An orthic triangle is formed by connecting the feet of the altitudes of a given triangle.\",\n    \"Formal Language\": \"OrthicTriangle \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Circumscribed Triangle\",\n    \"Definition\": \"A triangle that is contained within a circle such that all its vertices lie on the circle.\",\n    \"Formal Language\": \"CircumscribedTriangle \\subseteq Circle\"\n}\n```",
    "```json\n{\n    \"Name\": \"Altitude\",\n    \"Definition\": \"The perpendicular distance from the base of a geometric figure to the opposite highest point.\",\n    \"Formal Language\": \"Altitude \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Cevian\",\n    \"Definition\": \"A cevian is a line segment or line that extends from one vertex of a triangle to the opposite side, dividing it into two segments.\",\n    \"Formal Language\": \"Cevian \\in Geometry\"\n}",
    "```json\n{\n    \"Name\": \"Greek Cross\",\n    \"Definition\": \"A cross with four arms of equal length set at right angles, forming a square shape.\",\n    \"Formal Language\": \"Greek Cross \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polyomino Tiling\",\n    \"Definition\": \"The arrangement of polyominoes to completely cover a region or surface without overlaps or gaps.\",\n    \"Formal Language\": \"Polyomino Tiling \\in Geometric Arrangement\"\n}\n```",
    "```json\n{\n    \"Name\": \"Quadrilateral Tiling\",\n    \"Definition\": \"A geometric arrangement where a plane is covered completely without overlaps or gaps using quadrilaterals.\",\n    \"Formal Language\": \"Quadrilateral Tiling \\in Plane Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Regular Tessellation\",\n    \"Definition\": \"A pattern made by repeating a regular polygon to fill a plane without any gaps or overlaps.\",\n    \"Formal Language\": \"Regular Tessellation \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Semiregular Tessellation\",\n    \"Definition\": \"A pattern made with two or more types of regular polygons where each vertex configuration is the same.\",\n    \"Formal Language\": \"Semiregular Tessellation \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Corona\",\n    \"Definition\": \"In mathematics, 'corona' doesn't have a specific, widely recognized definition similar to its use in other disciplines like astronomy or virology. In the context of math, it might refer colloquially to a type of set or boundary in certain niche mathematical contexts.\",\n    \"Formal Language\": \"Undefined \\in Standard Mathematical Terms\"\n}\n```",
    "```json\n{\n    \"Name\": \"Square Tiling\",\n    \"Definition\": \"A type of tessellation where the plane is covered using square shapes with no gaps or overlaps.\",\n    \"Formal Language\": \"Square Tiling \\in Tessellation\"\n}\n```",
    "```json\n{\n    \"Name\": \"Tessellation\",\n    \"Definition\": \"A pattern of shapes that fit together without any gaps or overlaps, covering a plane completely.\",\n    \"Formal Language\": \"Tessellation \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Frieze Pattern\",\n    \"Definition\": \"A frieze pattern is a type of design that is formed by repeating a motif in a continuous band or strip along an infinite line, typically exhibiting symmetry and repetition.\",\n    \"Formal Language\": \"Frieze Pattern \\in Geometric Patterns\"\n}\n```",
    "```json\n{\n    \"Name\": \"Necker Cube\",\n    \"Definition\": \"An optical illusion representing a cube that can be interpreted in multiple ways regarding which face is in front, demonstrating the concept of perceptual ambiguity.\",\n    \"Formal Language\": \"Necker Cube \\in Optical Illusion\"\n}\n```",
    "```json\n{\n    \"Name\": \"Tiling\",\n    \"Definition\": \"The process of covering a surface with a pattern of flat shapes without overlaps or gaps.\",\n    \"Formal Language\": \"Tiling \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Uniform Tessellation\",\n    \"Definition\": \"A pattern made by repeating a regular polygon over a plane without any gaps or overlaps.\",\n    \"Formal Language\": \"Uniform Tessellation \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Hexagon Tiling\",\n    \"Definition\": \"A tessellation of the plane using regular hexagons. It is one of the three regular tessellations of the Euclidean plane, along with the square and triangular tiling.\",\n    \"Formal Language\": \"Hexagon Tiling \\in Tessellation\"\n}\n```",
    "```json\n{\n    \"Name\": \"Unit Square\",\n    \"Definition\": \"A square with each side measuring one unit in length, typically used in coordinate geometry.\",\n    \"Formal Language\": \"Unit Square \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Area\",\n    \"Definition\": \"The measure of the amount of space inside a two-dimensional boundary.\",\n    \"Formal Language\": \"Area \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Circumscribed\",\n    \"Definition\": \"A geometric term referring to a circle or other shape that passes through all the vertices of a polygon. In the context of circles, the circle is circumscribed around the polygon.\",\n    \"Formal Language\": \"Circumscribed \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Plane Geometry\",\n    \"Definition\": \"The branch of mathematics that deals with shapes and figures on a flat surface, such as points, lines, circles, and polygons.\",\n    \"Formal Language\": \"Plane Geometry \\subseteq Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Annulus\",\n    \"Definition\": \"A ring-shaped object, especially a region bounded by two concentric circles.\",\n    \"Formal Language\": \"Annulus \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Diameter\",\n    \"Definition\": \"The length of a straight line passing through the center of a circle or sphere and connecting two points on its boundary\",\n    \"Formal Language\": \"Diameter = 2 * Radius\"\n}\n```",
    "```json\n{\n    \"Name\": \"Nine-Point Circle\",\n    \"Definition\": \"A circle that can be constructed for any given triangle, passing through nine significant concurrent points such as the midpoint of each side, the foot of each altitude, and the midpoint of the line segment from each vertex to the orthocenter.\",\n    \"Formal Language\": \"Nine-Point Circle \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Enclosing Circle\",\n    \"Definition\": \"The smallest circle that can contain all points in a given set. It is also known as the minimum bounding circle.\",\n    \"Formal Language\": \"EnclosingCircle \\in Geometry\"\n}",
    "```json\n{\n    \"Name\": \"Circle-Circle Tangents\",\n    \"Definition\": \"Circle-circle tangents are lines that touch two circles at exactly one point each, without crossing the circles.\",\n    \"Formal Language\": \"Circle-Circle Tangents \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Rounded Rectangle\",\n    \"Definition\": \"A geometric shape similar to a rectangle, but with its corners replaced by circular arcs or rounded edges.\",\n    \"Formal Language\": \"Rounded Rectangle \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Semicircle\",\n    \"Definition\": \"A geometric shape that represents half of a circle, typically cut along the diameter.\",\n    \"Formal Language\": \"Semicircle = \\frac{1}{2} \\times \\text{Circle}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Circle Tangent Line\",\n    \"Definition\": \"A line that touches a circle at exactly one point\",\n    \"Formal Language\": \"A tangent line to a circle is perpendicular to the radius at the point of tangency\"\n}\n```",
    "{\n    \"Name\": \"Circumference\",\n    \"Definition\": \"The distance around a circle; it is equivalent to the perimeter of a circular shape.\",\n    \"Formal Language\": \"Circumference = 2πr \\lor Circumference = πd\"\n}",
    "```json\n{\n    \"Name\": \"Lune\",\n    \"Definition\": \"A lune is a two-dimensional shape formed by the intersection of two circular arcs, essentially a crescent shape.\",\n    \"Formal Language\": \"Lune \\subset \\mathbb{R}^2\"\n}\n```",
    "```json\n{\n    \"Name\": \"Concyclic\",\n    \"Definition\": \"A set of points is said to be concyclic if there exists a single circle on which all the points lie.\",\n    \"Formal Language\": \"Concyclic \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Rectangle\",\n    \"Definition\": \"A quadrilateral with four right angles\",\n    \"Formal Language\": \"Rectangle \\in Quadrilateral\"\n}\n```",
    "```json\n{\n    \"Name\": \"Brahmagupta's Formula\",\n    \"Definition\": \"A formula used to find the area of a cyclic quadrilateral given the lengths of its sides.\",\n    \"Formal Language\": \"Area = sqrt((s-a)(s-b)(s-c)(s-d)) where s is the semiperimeter: s = (a+b+c+d)/2\"\n}\n```",
    "```json\n{\n    \"Name\": \"Isosceles Trapezoid\",\n    \"Definition\": \"A trapezoid (a quadrilateral with at least one pair of parallel sides) that has non-parallel sides of equal length.\",\n    \"Formal Language\": \"Isosceles Trapezoid \\subset Quadrilateral\"\n}\n```",
    "```json\n{\n    \"Name\": \"Rhomboid\",\n    \"Definition\": \"A parallelogram in which adjacent sides are of unequal lengths and angles are oblique.\",\n    \"Formal Language\": \"Rhomboid \\in Quadrilaterals\"\n}\n```",
    "```json\n{\n    \"Name\": \"Kite\",\n    \"Definition\": \"A quadrilateral with two distinct pairs of adjacent sides that are equal in length.\",\n    \"Formal Language\": \"Kite \\in Quadrilateral\"\n}\n```",
    "```json\n{\n    \"Name\": \"Rhombus\",\n    \"Definition\": \"A quadrilateral with all four sides of equal length.\",\n    \"Formal Language\": \"Rhombus \\in Quadrilateral \\subseteq Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Right Trapezoid\",\n    \"Definition\": \"A trapezoid in which one of the legs is perpendicular to the bases, forming a right angle with one of them.\",\n    \"Formal Language\": \"Right Trapezoid \\in Quadrilateral\"\n}\n```",
    "```json\n{\n    \"Name\": \"Lozenge\",\n    \"Definition\": \"A rhombus or diamond-shaped quadrilateral, typically used to denote various mathematical and symbolic concepts, depending on the context, such as the lozenge operator in formal logic.\",\n    \"Formal Language\": \"Lozenge \\in Geometry/Symbol\"\n}\n```",
    "```json\n{\n    \"Name\": \"Skew Quadrilateral\",\n    \"Definition\": \"A quadrilateral where no two sides are parallel and no three vertices are collinear, often used to conceptualize space geometry in advanced levels.\",\n    \"Formal Language\": \"Skew Quadrilateral \\not\\in Plane Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Complete Quadrilateral\",\n    \"Definition\": \"A complete quadrilateral is a geometric figure formed by four lines and their six points of intersection.\",\n    \"Formal Language\": \"Complete Quadrilateral \\subseteq Plane Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Cyclic Quadrangle\",\n    \"Definition\": \"A quadrilateral (four-sided polygon) where all its vertices lie on the circumference of a single circle, known as the circumscribed circle.\",\n    \"Formal Language\": \"Cyclic Quadrangle \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Cyclic Quadrilateral\",\n    \"Definition\": \"A quadrilateral with all four vertices lying on the circumference of a circle.\",\n    \"Formal Language\": \"Cyclic Quadrilateral \\subseteq \\{Quadrilateral: \\text{Vertices} \\in Circle\\}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Trapezium\",\n    \"Definition\": \"A trapezium is a quadrilateral with at least one pair of parallel sides. In British and some other English-speaking countries' terminology, it often refers to a shape that corresponds to what is called a trapezoid in American English.\",\n    \"Formal Language\": \"Trapezium \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Trapezoid\",\n    \"Definition\": \"A four-sided figure (quadrilateral) with at least one pair of parallel sides.\",\n    \"Formal Language\": \"Trapezoid \\in Quadrilateral\"\n}\n```",
    "```json\n{\n    \"Name\": \"Parallelogram\",\n    \"Definition\": \"A quadrilateral with opposite sides that are parallel and equal in length.\",\n    \"Formal Language\": \"Parallelogram \\subseteq Quadrilateral\"\n}\n```",
    "```json\n{\n    \"Name\": \"Varignon Parallelogram\",\n    \"Definition\": \"In a quadrilateral, the midpoints of its sides form a parallelogram, known as Varignon's parallelogram.\",\n    \"Formal Language\": \"A quadrilateral ABCD has midpoints P, Q, R, S of sides AB, BC, CD, DA respectively. The polygon PQRS is Varignon's parallelogram.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Varignon's Theorem\",\n    \"Definition\": \"A theorem that states that the midpoints of the sides of any quadrilateral form a parallelogram.\",\n    \"Formal Language\": \"Let ABCD be a quadrilateral, then the quadrilateral formed by the midpoints of segments AB, BC, CD, and DA is a parallelogram.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Ptolemy's Theorem\",\n    \"Definition\": \"Ptolemy's Theorem states that for a cyclic quadrilateral (a quadrilateral inscribed in a circle), the sum of the products of its two pairs of opposite sides is equal to the product of its diagonals.\",\n    \"Formal Language\": \"If a cyclic quadrilateral has sides a, b, c, d and diagonals e, f, then \\(ac + bd = ef\\).\"\n}\n```",
    "{\n    \"Name\": \"Quadrangle\",\n    \"Definition\": \"A four-sided polygon, also known as a quadrilateral.\",\n    \"Formal Language\": \"Quadrangle \\in Polygon\"\n}",
    "```json\n{\n    \"Name\": \"Quadrilateral\",\n    \"Definition\": \"A polygon with four edges (or sides) and four vertices or corners.\",\n    \"Formal Language\": \"Quadrilateral \\in Polygon\"\n}\n```",
    "```json\n{\n    \"Name\": \"Vesica Piscis\",\n    \"Definition\": \"A shape formed by the intersection of two circles with the same radius, where the center of each circle lies on the circumference of the other.\",\n    \"Formal Language\": \"Vesica Piscis \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Arc\",\n    \"Definition\": \"A continuous portion of a circle's circumference.\",\n    \"Formal Language\": \"Arc \\subset Circle\\;Circumference, \\, Arc \\in Geometry\"\n}",
    "```json\n{\n    \"Name\": \"Major Arc\",\n    \"Definition\": \"A major arc is the longer of the two arcs formed when a circle is divided by any two points on its circumference. It measures more than 180 degrees.\",\n    \"Formal Language\": \"MajorArc \\subset Circle\"\n}\n```",
    "```json\n{\n    \"Name\": \"Circular Sector\",\n    \"Definition\": \"A circular sector is the portion of a circle enclosed by two radii and an arc.\",\n    \"Formal Language\": \"Circular Sector \\in Geometry, \\text{Area} = \\frac{\\theta}{360^\\circ} \\pi r^2 \\text{ where } \\theta \\text{ is the central angle in degrees}\"\n}\n```",
    "{\n    \"Name\": \"Minor Arc\",\n    \"Definition\": \"A minor arc is the smaller arc connecting two points on the circumference of a circle. It is the shortest arc between two points on a circle.\",\n    \"Formal Language\": \"Minor Arc \\in Geometry\"\n}",
    "```json\n{\n    \"Name\": \"Square Quadrants\",\n    \"Definition\": \"The four sections of a coordinate plane divided by the x-axis and y-axis. Each section is typically represented as a quadrant and holds a specific set of coordinates.\",\n    \"Formal Language\": \"Quadrants \\in Cartesian Plane\"\n}\n```",
    "```json\n{\n    \"Name\": \"Rational Point\",\n    \"Definition\": \"A point in a coordinate system where both coordinates are rational numbers.\",\n    \"Formal Language\": \"Rational Point \\in (ℚ, ℚ)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Postulate\",\n    \"Definition\": \"A statement assumed to be true without proof, used as a basis to prove other statements in mathematics and logic.\",\n    \"Formal Language\": \"Postulate \\in LogicalAssertion\"\n}\n```",
    "```json\n{\n    \"Name\": \"Two-Column Proof\",\n    \"Definition\": \"A method of proving mathematical statements using a structured format that includes two columns: one for statements and one for reasons that justify each statement.\",\n    \"Formal Language\": \"Two-Column Proof \\in Proof \\text{ method}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Translation Relation\",\n    \"Definition\": \"A transformation that shifts every point of a geometric figure or space by the same distance in a given direction.\",\n    \"Formal Language\": \"Translation \\in Transformation\"\n}\n```",
    "```json\n{\n    \"Name\": \"Lattice\",\n    \"Definition\": \"In mathematics, a lattice is an algebraic structure that can be viewed as an abstract framework used to model relations between a collection of elements characterized primarily by a binary latent operation.\",\n    \"Formal Language\": \"Lattice \\in Algebraic Structure\"\n}\n```",
    "```json\n{\n    \"Name\": \"Converse\",\n    \"Definition\": \"In logic, the converse of an implication statement is formed by interchanging its hypothesis and conclusion.\",\n    \"Formal Language\": \"If the original statement is 'If P, then Q', the converse is 'If Q, then P'.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Object\",\n    \"Definition\": \"In mathematics, an object is an abstract concept that can represent a mathematical entity or item with some properties and relations.\",\n    \"Formal Language\": \"Object \\in Abstract concept\"\n}\n```",
    "```json\n{\n    \"Name\": \"Congruence Axioms\",\n    \"Definition\": \"Congruence axioms are principles that determine when two figures or objects are deemed equivalent in geometry, typically in terms of shape and size.\",\n    \"Formal Language\": \"Congruence \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Parallel Postulate\",\n    \"Definition\": \"A fundamental element of Euclidean geometry which states that, given a line and a point not on that line, there is exactly one line parallel to the given line that passes through the point.\",\n    \"Formal Language\": \"Through a point not on a line, there is exactly one line parallel to the given line.\"\n}",
    "```json\n{\n    \"Name\": \"Equidistance Postulate\",\n    \"Definition\": \"The Equidistance Postulate states that if two points are each equidistant from the endpoints of a segment, then they lie on the perpendicular bisector of the segment.\",\n    \"Formal Language\": \"If P and Q are equidistant from A and B, then PQ is the perpendicular bisector of AB.\"\n}\n```",
    "{\n    \"Name\": \"Playfair's Axiom\",\n    \"Definition\": \"An axiom in geometry that states, 'Given a line and a point not on it, there is exactly one line parallel to the given line that passes through the given point.'\",\n    \"Formal Language\": \"Parallel Axiom  \\in Euclidean Geometry\"\n}",
    "```json\n{\n    \"Name\": \"Euclid's Postulates\",\n    \"Definition\": \"A set of five axioms that form the foundation for Euclidean geometry, including concepts such as the existence of a straight line between any two points, and the ability to extend a line segment indefinitely.\",\n    \"Formal Language\": \"Postulates \\subset Euclidean Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Grid\",\n    \"Definition\": \"A network of evenly spaced horizontal and vertical lines used to locate points or graph mathematical functions.\",\n    \"Formal Language\": \"Grid \\in Coordinate System\"\n}\n```",
    "```json\n{\n    \"Name\": \"Hexagonal Grid\",\n    \"Definition\": \"A hexagonal grid is a geometric structure composed of hexagons arranged in a tessellation pattern without gaps or overlaps.\",\n    \"Formal Language\": \"HexagonalGrid \\subseteq Tessellation\"\n}\n```",
    "{\n    \"Name\": \"Square Grid\",\n    \"Definition\": \"A spatial arrangement of squares in a regular pattern used, for example, in graph paper or a coordinate plane.\",\n    \"Formal Language\": \"SquareGrid \\in Space\"\n}",
    "```json\n{\n    \"Name\": \"Triangular Grid\",\n    \"Definition\": \"A network of equilateral triangles that create a tiling of the plane.\",\n    \"Formal Language\": \"Triangular Grid \\in Geometric Structure\"\n}\n```",
    "```json\n{\n    \"Name\": \"Geoboard\",\n    \"Definition\": \"A mathematical manipulative used to explore basic concepts in plane geometry such as perimeter, area, and the characteristics of polygons.\",\n    \"Formal Language\": \"Geoboard \\in Manipulative \\cap Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Complete Tree\",\n    \"Definition\": \"A binary tree in which all levels, except possibly the last, are completely filled, and the last level has all nodes as left as possible.\",\n    \"Formal Language\": \"Complete Tree \\in Data Structure\"\n}\n```",
    "```json\n{\n    \"Name\": \"Vertex Height\",\n    \"Definition\": \"The vertical distance from the base of an object to its vertex, often used in the context of geometric figures like triangles or pyramids.\",\n    \"Formal Language\": \"Vertex Height \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Star Graph\",\n    \"Definition\": \"A star graph is a type of tree graph in which one central vertex is connected directly to all other vertices, which have no other connections.\",\n    \"Formal Language\": \"Star Graph \\in Graph Theory\"\n}\n```",
    "```json\n{\n    \"Name\": \"Graph\",\n    \"Definition\": \"A visual representation of data or functions, often displayed with an x-axis and y-axis to show relationships between variables.\",\n    \"Formal Language\": \"Graph \\in Visualization\"\n}\n```",
    "```json\n{\n    \"Name\": \"Adjacent Vertices\",\n    \"Definition\": \"In a graph, two vertices are adjacent if they are connected by a single edge.\",\n    \"Formal Language\": \"Adjacent \\quad Vertices = \\{(u,v) \\ | \\ \\exists \\ e \\in E, \\ e=(u,v)\\} \\quad \\text{where} \\ E \\ \\text{is the set of edges in a graph}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Graph Directrix\",\n    \"Definition\": \"A directrix is a fixed line used in describing a curve or surface.\",\n    \"Formal Language\": \"Directrix \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Graph Vertex\",\n    \"Definition\": \"A fundamental part of graph theory, which represents a point in a network where two or more edges meet.\",\n    \"Formal Language\": \"Vertex \\in Graph\"\n}\n```",
    "```json\n{\n    \"Name\": \"Block\",\n    \"Definition\": \"In programming, a block refers to a section of code grouped together.\",\n    \"Formal Language\": \"Block \\in CodeStructure\"\n}\n```",
    "```json\n{\n    \"Name\": \"Centroid Point\",\n    \"Definition\": \"The point where the three medians of a triangle intersect, often considered the center of mass of a triangle.\",\n    \"Formal Language\": \"Centroid \\in \\mathbb{R}^2 \\text{ or } \\mathbb{R}^3\"\n}\n```",
    "{\n    \"Name\": \"Edge Count\",\n    \"Definition\": \"The number of edges in a given graph, where an edge is a connection between two vertices.\",\n    \"Formal Language\": \"Edge Count = |E|, where E is the set of all edges in the graph\"\n}",
    "```json\n{\n    \"Name\": \"Edge Set\",\n    \"Definition\": \"In graph theory, an edge set is the set of all edges in a graph, where each edge is a connection between two vertices.\",\n    \"Formal Language\": \"EdgeSet \\subseteq E(G), \\\\text{ where } E(G) \\\\text{ is the set of edges in graph } G\"\n}\n```",
    "```json\n{\n    \"Name\": \"Vertex Count\",\n    \"Definition\": \"The number of vertices in a geometric shape or graph.\",\n    \"Formal Language\": \"Vertex Count \\in \\mathbb{N}\"\n}\n```",
    "{\n    \"Name\": \"Graph Section\",\n    \"Definition\": \"A portion of a graph, typically visualized and analyzed to understand specific behavior or characteristics of a function within certain bounds.\",\n    \"Formal Language\": \"A Graph Section is described by subsets of the domain and range specific to certain segments of the graph.\"\n}",
    "{\n    \"Name\": \"End Vertex\",\n    \"Definition\": \"An end vertex is a vertex in a graph that has degree one, indicating it is connected by a single edge.\",\n    \"Formal Language\": \"End Vertex \\in Graph Theory\"\n}",
    "```json\n{\n    \"Name\": \"Planar Graph\",\n    \"Definition\": \"A graph that can be embedded in the plane so that no edges intersect except possibly at their endpoints.\",\n    \"Formal Language\": \"Planar Graph \\in Graph Theory\"\n}\n```",
    "{\n    \"Name\": \"Euler Graph\",\n    \"Definition\": \"A graph in which all vertices of odd degree are connected in such a way that there exists a trail that visits every edge exactly once.\",\n    \"Formal Language\": \"Euler Graph \\in Graph Theory\"\n}",
    "```json\n{\n    \"Name\": \"Unicursal Circuit\",\n    \"Definition\": \"A path in a graph that visits every edge exactly once and returns to the starting point, also known as an Eulerian circuit when it exists in an Eulerian graph.\",\n    \"Formal Language\": \"Unicursal Circuit \\in Graph Theory\"\n}\n```",
    "```json\n{\n    \"Name\": \"L-Polyomino\",\n    \"Definition\": \"An L-polyomino is a connected shape made up of squares in an L-shaped arrangement. Specifically, it consists of a configuration of four squares where three squares form a straight line and the fourth square is adjacent to the last square in the line, creating an 'L' shape.\",\n    \"Formal Language\": \"L-Polyomino \\in Combinatorial Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Monomino\",\n    \"Definition\": \"A monomino is a polygon made of a single square.\",\n    \"Formal Language\": \"Monomino \\in Polyomino \\text{, where } n=1\"\n}\n```",
    "{\n    \"Name\": \"Square Polyomino\",\n    \"Definition\": \"A polyomino is a geometric figure formed by joining one or more equal squares edge to edge. A square polyomino is specifically comprised of square units.\",\n    \"Formal Language\": \"Square Polyomino \\in Geometric Figure\"\n}",
    "```json\n{\n    \"Name\": \"Straight Polyomino\",\n    \"Definition\": \"A polyomino in which all cells are arranged in a straight line, resembling a simple chain with no branching.\",\n    \"Formal Language\": \"Straight Polyomino \\in Combinatorial Geometry\"\n}\n```",
    "{\n    \"Name\": \"Pentomino\",\n    \"Definition\": \"A geometric shape formed by joining five equal squares edge to edge.\",\n    \"Formal Language\": \"Pentomino \\in Geometry\"\n}",
    "```json\n{\n    \"Name\": \"T-Polyomino\",\n    \"Definition\": \"A polyomino consisting of four squares connected edge-to-edge in the shape of the letter T.\",\n    \"Formal Language\": \"T-Polyomino \\in Polyomino\"\n}\n```",
    "{\n    \"Name\": \"Tetromino\",\n    \"Definition\": \"A geometric shape composed of four squares, connected orthogonally.\",\n    \"Formal Language\": \"Tetromino \\in Polyomino\"\n}",
    "```json\n{\n    \"Name\": \"Hexomino\",\n    \"Definition\": \"A hexomino is a geometric shape composed of six connected squares of equal size, joined edge to edge.\",\n    \"Formal Language\": \"Hexomino \\subseteq Polyomino\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polyomino\",\n    \"Definition\": \"A plane geometric figure formed by joining one or more equal squares edge to edge.\",\n    \"Formal Language\": \"Polyomino \\in Geometry\"\n}\n```",
    "```json\n{\n    \"Name\": \"Triomino\",\n    \"Definition\": \"A geometric shape that consists of three squares connected edge-to-edge.\",\n    \"Formal Language\": \"Triomino \\subseteq Polyomino\"\n}\n```",
    "```json\n{\n    \"Name\": \"Chevron\",\n    \"Definition\": \"A V-shaped pattern often found in designs or used to indicate direction; in mathematics, it is not a standard concept or operator studied within K-12 curriculum as it doesn't relate directly to mathematical theories or operations.\",\n    \"Formal Language\": \"Chevron ∉ Mathematical Concepts in K-12\"\n}\n```",
    "```json\n{\n    \"Name\": \"Arch\",\n    \"Definition\": \"A curved structure that spans an opening, typically used in architectural contexts.\",\n    \"Formal Language\": \"Arch \\in Architecture\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polar Representation\",\n    \"Definition\": \"A way of expressing a complex number in terms of its magnitude and angle with respect to the positive real axis. It is typically represented in the form r(cos θ + i sin θ), where r is the magnitude and θ is the angle.\",\n    \"Formal Language\": \"z = r(cos θ + i sin θ) or z = re^(iθ), where r ∈ ℝ_0^+, θ ∈ [0, 2π)\"\n}\n```",
    "```json\n{\n    \"Name\": \"Measure\",\n    \"Definition\": \"In mathematics, a measure is a systematic way to assign a number to each suitable subset of that space, intuitively interpreted as its size.\",\n    \"Formal Language\": \"Measure \\in MeasureTheory\"\n}\n```",
    "```json\n{\n    \"Name\": \"Extreme Point\",\n    \"Definition\": \"A point on a graph where the function reaches a local minimum or maximum. These are points where the gradient is zero or undefined.\",\n    \"Formal Language\": \"Extreme Point = {x | f'(x) = 0 or f'(x) is undefined}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Rectangle Function\",\n    \"Definition\": \"A piecewise function used in signal processing to model idealized signals, typically having a constant value over a certain interval and zero elsewhere.\",\n    \"Formal Language\": \"Rectangle Function: rect(t) = {1 for |t| < 1/2, 0 elsewhere}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Equidistance Postulate\",\n    \"Definition\": \"A geometric postulate that states if two points are each equidistant from the endpoints of a segment, then they determine the perpendicular bisector of the segment.\",\n    \"Formal Language\": \"If A and B are equidistant from endpoints C and D of segment CD, then AB is the perpendicular bisector of CD.\"\n}\n```",
    "```json\n{\n    \"Name\": \"Playfair's Axiom\",\n    \"Definition\": \"An axiom in geometry which states that given a line and a point not on it, there is exactly one line parallel to the given line passing through the point.\",\n    \"Formal Language\": \"Playfair's Axiom: \\forall l, P \\notin l, \\exists! m \\text{ such that } m \\parallel l \\text{ and } P \\in m\"\n}\n```",
    "{\n    \"Name\": \"Euclid's Postulates\",\n    \"Definition\": \"A set of axioms or fundamental principles on which Euclidean geometry is based, proposed by the Greek mathematician Euclid.\",\n    \"Formal Language\": \"Euclid's Postulates \\in Axiom\"\n}",
    "{\n    \"Name\": \"Grid\",\n    \"Definition\": \"A network of horizontal and vertical lines that provide coordinates for locating points on a map or graph.\",\n    \"Formal Language\": \"Grid \\in Coordinate System\"\n}",
    "```json\n{\n    \"Name\": \"Hexagonal Grid\",\n    \"Definition\": \"A geometric arrangement of hexagons tiled closely together, often used in mathematics to study tessellations and coordinate systems.\",\n    \"Formal Language\": \"Hexagonal Grid \\in Geometric Arrangement\"\n}\n```",
    "```json\n{\n    \"Name\": \"Square Grid\",\n    \"Definition\": \"A grid layout composed of equal-sized squares arranged in rows and columns, often used in various mathematical and geometric applications.\",\n    \"Formal Language\": \"Square Grid \\in Geometry\"\n}\n```",
    "{\n    \"Name\": \"Triangular Grid\",\n    \"Definition\": \"A network of triangles that are connected at their vertices, often used in tessellations or discrete mathematics.\",\n    \"Formal Language\": \"Triangular Grid \\in Geometric Structures\"\n}",
    "```json\n{\n    \"Name\": \"Geoboard\",\n    \"Definition\": \"A mathematical manipulative used to explore basic concepts in plane geometry such as perimeter, area, and the properties of polygons.\",\n    \"Formal Language\": \"Geoboard \\in Manipulative Tool\"\n}\n```",
    "```json\n{\n    \"Name\": \"Tree Height\",\n    \"Definition\": \"In graph theory, the height of a tree is the length of the longest path from the root node to a leaf node.\",\n    \"Formal Language\": \"TreeHeight(T) = max{height(leaf) | leaf \\in T}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Complete Binary Tree\",\n    \"Definition\": \"A binary tree in which every level, except possibly the last, is completely filled, and all nodes are as far left as possible.\",\n    \"Formal Language\": \"Complete Binary Tree \\subset Binary Tree\"\n}\n```",
    "{\n    \"Name\": \"Vertex Height\",\n    \"Definition\": \"The vertical distance from the vertex of a geometric figure, typically a cone or pyramid, to the base of the figure.\",\n    \"Formal Language\": \"Vertex Height \\in \\mathbb{R}\"\n}",
    "```json\n{\n    \"Name\": \"Grid Graph\",\n    \"Definition\": \"A grid graph is a graph whose vertices correspond to the points in a regular grid, and edges correspond to joining vertices that are adjacent in the grid.\",\n    \"Formal Language\": \"Grid Graph \\in Graph Theory\"\n}\n```",
    "{\n    \"Name\": \"Adjacent Vertices\",\n    \"Definition\": \"Two vertices that are connected by a single edge in a graph.\",\n    \"Formal Language\": \"AdjacentVertices(v_i, v_j) \\iff (v_i, v_j) \\in E \\quad \\text{where } E \\text{ is the set of edges}\"\n}",
    "```json\n{\n    \"Name\": \"Graph Directrix\",\n    \"Definition\": \"A directrix is a line that serves as a reference point to geometric shapes. It is most commonly associated with parabolas, where a parabola is defined as the set of points equidistant from a focus and a line known as the directrix.\",\n    \"Formal Language\": \"Directrix \\in Geometry; \\exists p: Parabola(x, y) = {P(x, y) | d(P, Focus) = d(P, Directrix)}\"\n}\n```",
    "```json\n{\n    \"Name\": \"Centroid Point\",\n    \"Definition\": \"The point where the medians of a triangle intersect, often considered the center of mass or balance point of a triangular shape.\",\n    \"Formal Language\": \"Centroid \\in Point\"\n}\n```",
    "```json\n{\n    \"Name\": \"Edge Count\",\n    \"Definition\": \"In graph theory, the edge count refers to the number of edges in a graph.\",\n    \"Formal Language\": \"Edge\\_Count \\in Graph\\_Theory\"\n}\n```",
    "```json\n{\n    \"Name\": \"Vertex Count\",\n    \"Definition\": \"The number of vertices (or nodes) in a graph or geometric shape.\",\n    \"Formal Language\": \"VertexCount \\in \\mathbb{N}\"\n}\n```",
    "{\n    \"Name\": \"Graph Arc\",\n    \"Definition\": \"In graph theory, an arc is a directed edge in a graph that connects two nodes.\",\n    \"Formal Language\": \"Arc \\in Graph Theory\"\n}",
    "```json\n{\n    \"Name\": \"End Vertex\",\n    \"Definition\": \"A vertex in a graph or network where an edge terminates; it is often used in the context of discussions about arcs or connections between vertices.\",\n    \"Formal Language\": \"End Vertex \\in Graph Theory\"\n}\n```",
    "```json\n{\n    \"Name\": \"Euler Graph\",\n    \"Definition\": \"A graph that contains a closed path (Eulerian circuit) that visits every edge exactly once.\",\n    \"Formal Language\": \"Euler Graph \\in Graph Theory\"\n}\n```",
    "```json\n{\n    \"Name\": \"Unicursal Circuit\",\n    \"Definition\": \"A unicursal circuit is a path on a graph that visits every edge exactly once, returning to the starting vertex. Essentially, it is an Eulerian circuit in graph theory.\",\n    \"Formal Language\": \"Unicursal Circuit \\in Graph Theory\"\n}\n```",
    "```json\n{\n    \"Name\": \"Monomino\",\n    \"Definition\": \"A monomino is a polyomino consisting of a single square. In geometry, it is the simplest form of a polyomino and is used primarily in tiling problems.\",\n    \"Formal Language\": \"Monomino \\in Polyomino\"\n}\n```",
    "```json\n{\n    \"Name\": \"Straight Polyomino\",\n    \"Definition\": \"A polyomino that forms a single straight line of squares joined edge to edge.\",\n    \"Formal Language\": \"StraightPolyomino \\subset Polyomino \\subset \\mathbb{N}^2\"\n}\n```",
    "```json\n{\n    \"Name\": \"Pentomino\",\n    \"Definition\": \"A pentomino is a plane geometric figure composed of five equal-sized squares, connected edge-to-edge.\",\n    \"Formal Language\": \"Pentomino \\in Polyomino\"\n}\n```",
    "```json\n{\n    \"Name\": \"Tetromino\",\n    \"Definition\": \"A geometric shape composed of four squares, connected orthogonally.\",\n    \"Formal Language\": \"Tetromino \\in Geometric Shapes\"\n}\n```",
    "```json\n{\n    \"Name\": \"Hexomino\",\n    \"Definition\": \"A hexomino is a geometric figure composed of six connected squares of equal size, joined edge to edge.\",\n    \"Formal Language\": \"Hexomino \\in Polyomino\"\n}\n```",
    "```json\n{\n    \"Name\": \"Polyomino\",\n    \"Definition\": \"A geometric figure formed by joining one or more equal squares edge to edge. The squares may be rotated, but not overlapped.\",\n    \"Formal Language\": \"Polyomino \\in Geometric figure\"\n}\n```",
    "{\n    \"Name\": \"Arch\",\n    \"Definition\": \"In mathematics and architecture, an arch refers to a curved structure that spans an opening and is typically supported at both ends. In geometry, it can be related to the concept of arcs in circles.\",\n    \"Formal Language\": \"Arch \\in Geometry, Architecture\"\n}",
    "{\n    \"Name\": \"Measure\",\n    \"Definition\": \"A measure is a systematic way of assigning a number to each suitable subset of that space, intuitively interpreted as its size.\",\n    \"Formal Language\": \"Measure: \\mu : \\mathcal{F} \\rightarrow [0, \\infty]\"\n}"
]