{
    "Number": "The concept of a number, representing a mathematical entity used to measure, count, and label.",
    "Real": "\\in Number: Real number",
    "NonNegativeNumbers": "\\in Real: Real numbers that are greater or equal than zero.",
    "NegativeNumbers": "\\in Real: Real numbers less than zero.",
    "PositiveNumbers": "\\in Real: Real numbers greater than zero.",
    "TranscendentalNumbers": "\\in Irrational: Numbers that are not the roots of any non-zero polynomial equation with integer coefficients. Example: ( \\pi, e ).",
    "AlgebraicNumbers": "\\in Real: Numbers that are the roots of some non-zero polynomial equation with integer coefficients. ",
    "IrrationalNumbers": "\\in Real: Numbers that cannot be expressed as a simple fraction, such as sqrt(2).",
    "Integers": "\\in Real Numbers: Real numbers include both rational and irrational numbers, and they can be represented on the number line.",
    "EvenNumbers": "\\in Integers: Integers divisible by 2.",
    "OddNumbers": "\\in Integers: Integers not divisible by 2.",
    "PositiveIntegers": "\\in Integers: Integers greater than zero.",
    "NegativeIntegers": "\\in Integers: Integers less than zero.",
    "NonNegativeIntegers": "\\in Integers: Integers that are greater or equal than zero.",
    "NaturalNumbers": "\\in Integers: Integers are whole numbers that can be positive, or zero.",
    "PrimeNumbers": "\\in NaturalNumbers: A natural number greater than 1 that has no positive divisors other than 1 and itself.",
    "CompositeNumbers": "\\in NaturalNumbers: A natural number greater than 1 that is not prime.",
    "RationalNumbers": "\\in Real: Numbers that can be expressed as the ratio of two integers, such as fractions.",
    "Decimals": "\\in Real: Real numbers that are expressed in the form of a decimal expansion, which can either be terminating or repeating.",
    "RepeatingDecimals": "\\in Decimals: Repeating decimals.",
    "ComplexNumbers": "\\in Number: Numbers of the form (a + bi), where (a) and (b) are real numbers, and (i) is the imaginary unit.",
    "ImaginaryNumbers": "\\in ComplexNumbers: Numbers of the form (bi), where (b) is a real number and (i^2 = -1).",
    "ComplexUnit": "\\in ComplexNumbers: The imaginary unit i.",
    "Infinity": "A concept about infinite numbers.",
    "PositiveInfinity": "+ \\infty",
    "NegativeInfinity": "- \\infty",
    "Polynomial": "\\in Expression: Mathematical expression consisting of variables(numbers) and coefficients, combined using operations.",
    "Monomial": "\\in Polynomial: A polynomial with only one term, such as 3x^2 or 5.",
    "IrreduciblePolynomial": "\\in Polynomial: A polynomial that cannot be factored into polynomials of lower degree with coefficients in a field.",
    "QuadraticPolynomial": "A polynomial whose expression has the form ( ax^2 + bx + c ), where ( a, b, c ) are constants, and ( a \neq 0 ).",
    "CubicPolynomial": "A polynomial whose expression has the form ( ax^3 + bx^2 + cx + d ), where ( a, b, c, d ) are constants, and ( a \neq 0 ).",
    "Function": "A mathematical relationship where each input (from the domain) corresponds to exactly one output (in the codomain).",
    "QuadraticFunction": "A function that its expression has the form of ax^2 + bx + c.",
    "CubicFunction": "A function that its expression has the form of ax^3 + bx^2 + cx + d.",
    "Set": "A collection of distinct objects, considered as an object in its own right.",
    "Sequence": "\\in Set: A list of numbers arranged in a specific order, usually following a particular pattern or rule.",
    "ArithmeticSequence": "\\in Sequence: A sequence where the difference between consecutive terms is constant.",
    "GeometricSequence": "\\in Sequence: A sequence where each term is found by multiplying the previous term by a constant ratio.",
    "HarmonicSequence": "\\in Sequence: A sequence where each term is the reciprocal of a natural number.",
    "Expression": "A mathematical phrase consisting of numbers, variables, and operators (such as +, *) that represents a value or relationship.",
    "Equation": "\\in Prop : A statement where two expressions are set equal to each other. ",
    "Inequation": "\\in Prop : A statement where two expressions are compared using inequality signs (>, <, ≥, ≤, ≠) instead of equality.",
    "Operator": "A new defined operator."
}